[{"_id":{"$oid":"5b5c8cd7276e2200208fed62"},"code":"UNI01","points":0,"name":"Jumping Rahul","description":"Rahul is playing a VR game. He is stuck in a mission and needs your help.\r\nIn this mission, Rahul is stranded on a rock and needs to jump through a series of rock to save himself from falling into a death vortex. You are given <b>T</b> scenarios and at each scenario you have to tell whether Rahul will be able to jump on any of the rocks around him or not.\r\n\r\nNow the problem is, Rahul can only jump on rock which can handle the weight greater than his weight. Luckily you know all the information, help Rahul by telling to jump on which rock.","explainInput":"First line of input contains T - the number of test cases. Next T lines contains 5 spaced integers.\r\nFirst integer represents the weight of Rahul and the rest 4 integers represent the weight a rock can handle which is around him.","explainOutput":"Print the weight of rock with maximum weight which will handle Rahul's weight. If there is no such rock print <b>-1</b>.","example":"<b>Input</b>:\r\n3\r\n4 2 3 1 5\r\n4 2 8 1 4\r\n4 2 3 1 4\r\n<b>Output</b>:\r\n5\r\n8\r\n-1","explanation":"","tags":["adhoc"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FUNIVERSE%2FvD3IZpaMv.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FUNIVERSE%2FvD3IZpaMv.in?alt=media","contestCode":"UNIVERSE","createdAt":{"$date":"2018-07-28T15:33:43.03Z"},"updatedAt":{"$date":"2018-11-11T14:18:53.641Z"},"__v":0,"constraints":"1 <= T <= 50\r\n1 <= N, W[i] <= 1000"}
,{"_id":{"$oid":"5b645f711b2cd40020b6c771"},"code":"AUG18A","points":100,"name":"Avengers Unite","description":"The world is under a new threat, and as always, “With great power, comes great responsibility”. The Avengers are back to defeat the evil, and bring peace to the world. However it seems like this time it’s not going to be so easy. So The Avengers decide to gain more power from The 5 Rings of Energy.\r\n\r\nEach Avenger is allotted only a particular ring to wear as follows :-\r\n( Format: Avenger - Ring )\r\nironman - light\r\ndoctor strange - magic\r\nthor - strength\r\nblack widow - stealth \r\ncaptain america - earth\r\n\r\nHowever the rings can only provide power to their masters if they wear them in a specific order.\r\nYou will be given the order of the rings to be worn by the Avengers, help them to find out the order in which they will wear the rings.\r\n(See the example for clarification)\r\n","explainInput":"The first line of the input will consist of a single integer T, which denotes the number of Test Cases (the number of times your program will be tested / the number of questions).\r\nEach test case consists of 5 lines of input which displays the required order of the rings. Each of these lines will display the name of the rings (which are : stealth, light, magic, earth, strength).\r\n(All inputs are of lowercase alphabets)\r\n","explainOutput":"For each test case, print 5 lines of output describing the order in which The Avengers (which are : black widow, doctor strange, ironman, thor, captain america) will have to wear the rings.","constraints":"1 <= T <= 50\r\nAll input and output alphabets are of lowercase\r\n","example":"Input:\r\n2\r\nstrength\r\nlight\r\nearth\r\nmagic \r\nstealth\r\nearth\r\nstealth\r\nmagic \r\nstrength\r\nlight\r\n\r\nOutput:\r\nthor\r\nironman\r\ncaptain america\r\ndoctor strange \r\nblack widow\r\ncaptain america\r\nblack widow\r\ndoctor strange \r\nthor\r\nironman\r\n","explanation":"Let us consider the first test case. \r\nThe order of the rings to be worn is : strength - light - earth - magic - stealth.\r\nTherefore the order of the Avengers who will wear those rings is :\r\nthor - ironman - captain america - doctor strange - black widow , as The Avengers are allotted those particular rings ( see description ).\r\n","tags":["adhoc","strings"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FAUG18%2Fxax_WExh4.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FAUG18%2Fxax_WExh4.in?alt=media","contestCode":"AUG18","createdAt":{"$date":"2018-08-03T13:58:09.353Z"},"updatedAt":{"$date":"2018-11-11T14:33:40.421Z"},"__v":0}
,{"_id":{"$oid":"5b64600d1b2cd40020b6c772"},"code":"AUG18C","points":100,"name":"Doctor Strange to the rescue","description":"The evil has finally revealed himself, Rahul wants to extinct the human race.\r\nThe Ironman is facing a bit of a trouble fighting against Rahul.\r\n\r\nThor has some secret words which can help Ironman defeat Rahul easily. But with his programming skills, Rahul hacked the messages of Thor and disturbed the words sent by him. \r\n\r\nBut Doctor Strange comes to the rescue. He comes up with his magical powers    and finds a way to convert the disturbed words back to the normal words. He says that in a given disturbed word, if we remove all the occurrences of the alphabets ‘r’ , ‘a’ , ‘h’ , ‘u’ , ‘l’ , we will get the normal word sent by Thor.\r\nBut as Doctor Strange is not so good at programming, he asks for your help to find out the initial word sent by Thor, using this conversion.\r\n","explainInput":"The first line of the input consists of a single integer N, denoting the number of words sent by Thor. (which are eventually disturbed by Rahul)\r\nThe next N lines follow.\r\nThe ith of these lines describe a disturbed word. (1 <= i <= N)\r\n(all words have only lowercase alphabets)\r\n(the length of the words doesn’t exceed 30 and is not less than 1)\r\n","explainOutput":"Output N lines.\r\nThe ith of these lines should describe the initial word sent by Thor corresponding to the ith of the disturbed words. (1 <= i <= N)","constraints":"1 <= N <= 50\r\nAll words have only lowercase alphabets\r\nThe length of the words doesn’t exceed 30 and is not less than 1\r\n","example":"Input:\r\n6\r\navengers\r\nbatman\r\nsies\r\nrahul\r\nlol\r\nprogramming\r\n\r\nOutput:\r\nvenges\r\nbtmn\r\nsies\r\n\r\no\r\npogmming\r\n","explanation":"Let us take the example of “batman” , removing all instances of ‘r’ , ‘a’ , ‘h’ ,  ‘u’ , ‘l’ ,\r\n            We get “btmn”.\r\nSimilarly “sies” has no occurrence of the alphabets ‘r’ , ‘a’ , ‘h’ ,  ‘u’ , ‘l’ . Therefore the   output is “sies”.\r\n            Also, all the alphabets in “rahul” have the occurrence of the alphabets ‘r’ , ‘a’ , ‘h’ ,  ‘u’ , ‘l’ .\r\n            Therefore the output is an empty line.\r\n","tags":["adhoc","strings"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FAUG18%2FMnBrOpSqV.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FAUG18%2FMnBrOpSqV.in?alt=media","contestCode":"AUG18","createdAt":{"$date":"2018-08-03T14:00:45.091Z"},"updatedAt":{"$date":"2018-11-11T14:34:52.305Z"},"__v":0}
,{"_id":{"$oid":"5b649819c0b1b80020eb30e1"},"code":"AUG18B","points":100,"name":"Cibin Needs To Bunk","description":"“ It’s not who you are underneath, It’s what you do that defines you “ . Cibin has kept this a secret for a long time, he is one of the Avengers. He needs to help the Avengers to save the world from a new evil. But as always, even if the world is at a threat, attendance is the most important thing for students. \r\n\r\nAll Cibin needs to do, is to keep his attendance greater than or equal to 75%.\r\nThere are a total of N lectures. Cibin has attended P lectures till now, and has bunked A lectures till now. As Cibin also needs to save the world, find out the minimum number of more lectures he needs to attend so that his attendance will be greater than or equal to 75%.","explainInput":"The first line of the input consists of a single integer T, denoting the number of Test Cases. \r\nEach test case consists of one single line.\r\nEach of these single lines consists of 3 space separated integers N, P and A.\r\n","explainOutput":" For each test case, output one single line.\r\nEach line should contain the answer to the corresponding test case, the minimum number of more lectures he needs to attend so that his attendance will be greater than or equal to 75%.\r\nIf there is a chance that even after attending all the remaining lectures, his attendance remains less than 75%, print -1 instead.    ","constraints":"1 <= T <= 50\r\n0 <= A, P <= N <= 1000\r\n","example":"Input:\r\n3\r\n20 10 3\r\n5 1 0\r\n20 5 12\r\n\r\nOutput:\r\n5\r\n3\r\n-1\r\n","explanation":"Test Case 1:\r\nCibin can attend 5 lectures out of 7 remaining lectures, which makes his attendance 15/20 = 75%.\r\n\r\nTest Case 3:\r\nEven if Cibin attends the remaining 3 lectures, his attendance remains 8/20 = 40%.\r\nAs it is less than 75%, answer is -1.\r\n","tags":["adhoc","math"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FAUG18%2FxSwI3Ntw9.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FAUG18%2FxSwI3Ntw9.in?alt=media","contestCode":"AUG18","createdAt":{"$date":"2018-08-03T17:59:53.89Z"},"updatedAt":{"$date":"2018-11-11T14:35:26.712Z"},"__v":0}
,{"_id":{"$oid":"5b6c3ec18cab100020e963b7"},"code":"SRM01A","points":100,"name":"Tom vs Jerry","description":"Seems like Jerry stole a piece of cheese again, and it’s another day of fight between Tom and Jerry. They decided to settle their fight with a tennis match.\r\n\r\nThe tennis match consists of 10 rounds. In each round either Tom or Jerry gets 1 point. The player with the maximum points after the 10 rounds wins the game.\r\nIn case if their points are equal, it is a draw.\r\n\r\nHowever, since no one is officiating the games they need your help in deciding the winner. Can you help them to decide the winner before they start fighting again?","explainInput":"The first line of input contains a single integer T denoting the number of test cases. ( The number of times your program will be tested / The number of questions )\r\nEach test case consists of only one line, consisting of 10 space separated integers.\r\nEach of these integers is either 1 or 0.\r\n1 indicates that, Jerry won the round.\r\n0 indicates that, Tom won the round.","explainOutput":"For each test case, output a single integer on a single line :\r\n1 in case if Jerry wins the match.\r\n0 in case if Tom wins the match.\r\n-1 in case if it is a draw.","constraints":"1  <= T <= 50","example":"<b>Input:</b>\r\n3\r\n0 0 1 1 0 1 1 0 1 1\r\n0 0 0 0 0 0 0 0 1 0\r\n1 0 1 0 1 0 1 0 1 0\r\n \r\n<b>Output:</b>\r\n1\r\n0\r\n-1","explanation":"Test case 1 :\r\nAs there are 6 - 1’s and 4 - 0’s Jerry wins the match, print 1.\r\nTest case 2 : \r\nAs there are 9 - 0’s and 1 - 1 Tom wins the match, print 0.\r\nTest case 3 :\r\nAs there are 5 - 1’s and 5 - 0’s It is a draw, print -1.","tags":["adhoc","math"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM01%2FpHOLjc27S.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM01%2FpHOLjc27S.in?alt=media","contestCode":"SRM01","createdAt":{"$date":"2018-08-09T13:16:49.977Z"},"updatedAt":{"$date":"2018-11-11T14:20:14.946Z"},"__v":0}
,{"_id":{"$oid":"5b6c3fc08cab100020e963b8"},"code":"SRM01B","points":200,"name":"Scooby Doo Is In Danger","description":"Shaggy and Scooby are in the middle of another magical mystery and apparently Scooby Doo’s life is in danger, he is trapped in a burning house which is locked by a magical door. Shaggy is trying to help Scooby.\r\n\r\nThe door has a word (all alphabets are lowercase) written on it. To open the door, all Shaggy needs to do is to pick some alphabets from that word ( in any order ) and try to form the word “scooby” out of them. \r\n\r\nYour task is to find out if it is possible to save Scooby Doo.","explainInput":"The first line of input contains a single integer T denoting the number of test cases. ( The number of times your program will be tested / The number of questions )\r\nEach test case consists of a single line containing the initial word written on the door.","explainOutput":"Output T lines.\r\nEach of these lines should contain the answer to the corresponding testcase :\r\n“yes” (without quotes, all alphabets are lowercase) if it is possible to save Scooby Doo.\r\n“no”  (without quotes, all alphabets are lowercase) if it is NOT possible to save Scooby Doo.\r\n( see example for clarification )","constraints":"1 <= T <= 50\r\nLength of the input word is greater than or equal to 1 and less than or equal to 100.\r\nAll the alphabets of the input words are of lowercase.","example":"<b>Input:</b>\r\n5\r\nscsobsoybysbo\r\nscoby\r\nyyyzbbbzooozcczssss\r\nscccozzbboooaaalllobbbbb\r\najsosccafsossobsyby\r\n \r\n<b>Output:</b>\r\nyes\r\nno\r\nyes\r\nno\r\nyes","explanation":"The 1st , 3rd the 5th test cases have enough alphabets needed to form “scooby” from them.\r\nTest case 2:\r\nThe  word is missing one more ‘o’, so “scooby” cannot be formed.\r\nTest case 4:\r\nThe word is missing ‘y’, so “scooby” cannot be formed.","tags":["adhoc","strings"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM01%2FhgI3OnYpp.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM01%2FhgI3OnYpp.in?alt=media","contestCode":"SRM01","createdAt":{"$date":"2018-08-09T13:21:04.58Z"},"updatedAt":{"$date":"2018-11-11T14:20:28.054Z"},"__v":0}
,{"_id":{"$oid":"5b6c42d08cab100020e963b9"},"code":"SRM01C","points":250,"name":"Save Dexter’s Laboratory","description":"Dee Dee has caused some trouble to Dexter once again and now his whole lab is about to explode! To prevent this destruction, Dexter has to perform a simple task. He is given a sequence of N integers and a set of Q queries. In each query, he is given two integers i and j. For each query, he has to find the difference between the ith greatest integer and jth smallest integer in the given sequence.\r\n\r\nHowever, Dexter is too busy for solving this problem, as he is fighting against his arch-enemy Mandark. Can you help Dexter to save his laboratory by finding the required difference in each query?","explainInput":"The first line consists of a single integer T denoting the number of testcases.  \r\nThe first line of each test case consists of a single integer N denoting the number of integers in the sequence.\r\nThe second line of the test case consists of N space-separated integers (The sequence) .\r\nThe third line of the test case consists of a single integer Q denoting the number of queries.\r\nQ lines follow:\r\nEach of these lines consists of two space-separated integers i and j.","explainOutput":"Output Q lines.\r\nEach of these lines should consist of a single integer : the answer to the corresponding query, which is the difference between the ith greatest integer and the jth smallest integer in the given sequence.\r\n( ith greatest integer - jth smallest integer)","constraints":"1 <= T <= 10  \r\n1 <= N <= 100000\r\n-100000 <= A(k) <= 100000 ( where A(k) is the kth element in the sequence. ( 1 <= k <= N ) )\r\n1 <= Q <= 10000\r\n1 <= i, j <= N","example":"<b>Input:</b>\r\n1  \r\n5  \r\n4 10 -1 7 -3 \r\n2\r\n2 3\r\n4 5\r\n \r\n<b>Output:</b>\r\n3\r\n-11","explanation":"Test Case 1:\r\n\r\nQuery 1:\r\n2nd greatest integer => 7\r\n3rd smallest integer => 4\r\nAnswer = 7 - 4 = 3\r\nQuery 2:\r\n4th greatest integer => -1\r\n5th smallest integer => 10\r\nAnswer = -1 - 10  = -11","tags":["math,sorting"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM01%2F9I3ExSbJ.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM01%2F9I3ExSbJ.in?alt=media","contestCode":"SRM01","createdAt":{"$date":"2018-08-09T13:34:08.554Z"},"updatedAt":{"$date":"2020-02-06T15:57:12.233Z"},"__v":0}
,{"_id":{"$oid":"5b714d3c155c0000206d76fc"},"code":"SRM02C","points":250,"name":"Pritam Likes Cupcakes","description":"Pritam has decided to throw a party for passing his CCDSAP Exam.\r\nHe has decided to keep <b>N</b> cupcakes for the party. Unfortunately, Pritam needs the number of cupcakes to be square of any real number. He can throw away some cupcakes or buy new ones.\r\nTell us how many minimum cupcakes in total Pritam needs to throw or buy so that it becomes a square of any real number.","explainInput":"First line of input consists of <b>T</b> the number of test cases. Each test consists of <b>N</b>.\r\n","explainOutput":"Print in each line the minimum number of cupcakes Pritam throws or buys.","constraints":"1 <= T <= 10000\r\n1 <= N <= 10<sup>12</sup>","example":"<b>Input:</b>\r\n3\r\n1\r\n3\r\n6\r\n\r\n<b>Output:</b>\r\n0\r\n1\r\n2\r\n\r\n","explanation":"Case 1: Pritam has already square numbered cupcakes.\r\nCase 2: Pritam can throw 2 cupcakes (N-2=1) or buy one more(N+1=4). Ans = min(2,1) = 1. \r\nCase 3: Pritam can throw 2 or buy 3 cupcakes it doesn't matter so Ans = min(2,3) = 2.","tags":["math"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM02%2FZmDHRv1FX.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM02%2FZmDHRv1FX.in?alt=media","contestCode":"SRM02","createdAt":{"$date":"2018-08-13T09:19:56.688Z"},"updatedAt":{"$date":"2018-11-11T14:21:33.385Z"},"__v":0}
,{"_id":{"$oid":"5b72e7f9750b6100209d9f12"},"code":"SRM02A","points":100,"name":"Pritam Loves Discount","description":"Pritam lives in a ghostly town named Lodha Heaven (not that he wishes to live there). He travels through bus to another cities that he wishes to explore. Bus fare for any location is any positive integer R but if Pritam books ticket for the round trip from the same bus then he receives 10% discount on the total incurred bus fare.\r\nPritam always seeks to save some money through his bus trips so that he can buy BTS Official Album DVD’s. As Pritam is busy planning his future bus trips, he needs your help.\r\nYour task is to find the minimum amount of bus fare Pritam will have to pay on a complete trip given the bus fare for one side journey for that trip.","explainInput":"The first line of input contain an integer <b>T</b> denoting the number of test cases. Each test case consists of one line, which contains the integers <b>R</b> - the price for one side of the trip.\r\n","explainOutput":"For each test case, output a single line with the integer which is minimum amount of money Pritam will incur as bus fare on a particular trip. Your answer will be considered correct if it has an absolute error less than 10<sup>-2</sup>.","constraints":"1 <= T <= 10<sup>5</sup>\r\n10 <= R <= 10<sup>16</sup>\r\n","example":"<b>Input:</b>\r\n2\r\n25\r\n20\r\n\r\n<b>Output:</b>\r\n45.00\r\n36.00\r\n","explanation":"Test case 1: Total cost for the first trip is Rs 50. After applying 10% discount  on total price, Pritam gets Rs 5 off. So total cost of complete trip is 50 - 5 = Rs 45.00\r\n\t\r\nTest Case 2: Total cost for the first trip is Rs 40 . After applying 10% discount on total price, Pritam gets Rs 4 off. So total cost of complete trip is 40 - 4 = Rs 36.00","tags":["math"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM02%2FeqFDmeVlL.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM02%2FeqFDmeVlL.in?alt=media","contestCode":"SRM02","createdAt":{"$date":"2018-08-14T14:32:25.893Z"},"updatedAt":{"$date":"2018-11-11T14:22:03.411Z"},"__v":0}
,{"_id":{"$oid":"5b72f1a5750b6100209d9f13"},"code":"SRM02B","points":200,"name":"Pritam Hates Bus Conductor","description":"As you all know, Pritam loves to go on trips. Hence buses are like lifeline for Pritam. But nothing ever ideal happens with Pritam as he wishes for. \r\nBus conductor of the buses which Pritam aboards are usually bad at Math. So this always costs Pritam some extra money. Back at home, Pritam was reviewing some old tickets and the amount he paid for them. \r\nBut as usual Pritam is busy planning for his future trips. So he needs your help again.\r\nSo given a ticket code and the expression for total amount of ticket your task is to count the total number of ticket for which Pritam paid extra money and print those ticket codes in which they appear in the input sequence.  ","explainInput":"The first line of input contain an integer <b>T</b> denoting the number of test cases. \r\nFirst line of each test case contains <b>N</b>.\r\nNext <b>N</b> lines contain space separated input of ticket code and expression for bus fare calculation.\r\nEach line contains <b>CODE</b> seperated by space with expression of <b>PxCOST=SUM</b> Here P, COST and SUM are integers","explainOutput":"For each test case output the number of invalid tickets and the ticket codes which are invalid. ","constraints":"1 <= T <= 100\r\n1 <= N <= 10<sup>3</sup>\r\n1 <= |CODE| <= 10<sup>2</sup>\r\n1 <= P, COST, SUM <= 10<sup>9</sup>","example":"<b>Input:</b>\r\n1\r\n5\r\nSAB180X1 2x9=18\r\nSAB180X2 2x3=6\r\nSAB180X3 12x9=118\r\nSAB180X4 7x7=50\r\nSAB180X5 3x9=17\r\n\r\n<b>Output:</b>\r\n3\r\nSAB180X3\r\nSAB180X4\r\nSAB180X5","explanation":"Code for 3<sup>rd</sup>, 4<sup>th</sup> and 5<sup>th</sup> ticket in the input sequence is incorrect.   Hence count of invalid tickets is 3.","tags":["strings"],"outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM02%2FprDGEYnab.out?alt=media","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM02%2FprDGEYnab.in?alt=media","contestCode":"SRM02","createdAt":{"$date":"2018-08-14T15:13:41.929Z"},"updatedAt":{"$date":"2018-11-11T14:22:51.19Z"},"__v":0}
,{"_id":{"$oid":"5b96a51f9808fa0020a42972"},"code":"SRM03A","points":100,"name":"Convincing Rahul","description":"Suriya is the head of an event in Cognition and he is convincing Rahul to participate in the event.\r\nBut as we all know, Rahul is very good at ignoring events. He wishes to sleep for 3 days instead of visiting the college during Cognition. But as Suriya is his friend, Rahul would participate only if Suriya solves the following puzzle.\r\n\r\nRahul has given 3 numbers A, B and C. Suriya is supposed to insert two operators between them in order to form an expression. Let the value of this expression be Y.\r\ni.e. A ( operator 1 ) B ( operator 2 ) C  =  Y\r\nThese operators can only either be addition ( + ) or multiplication ( * ).\r\nSuriya has freedom to insert any operator wherever he wishes. He is also allowed to insert the same operator twice.\r\n\r\nIn order to solve the puzzle Suriya has to find the maximum possible value of Y.\r\nHelp Suriya in solving the puzzle.\r\n\r\n( NOTE : In case where both the operators are used, use BODMAS to calculate the value of Y. i.e. Multiplication should be performed before addition. )\r\n            ","explainInput":"The first line of the input consists of a single integer T, denoting the number of Test Cases. \r\nEach test case consists of a single line containing 3 space-separated integers A B and C.","explainOutput":"For each test case, output a single line consisting of a single integer, the maximum possible value of Y.","constraints":"1 <= T <= 1000\r\n0 <= A, B, C <= 1000","example":"Input:\r\n2\r\n2 2 3\r\n3 2 4\r\n\r\nOutput:\r\n12\r\n24","explanation":"Test Case 1 :\r\nThe maximum value of Y can be obtained by the following equation :\r\n2 * 2 * 3 = 12","tags":["adhoc,math"],"inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM03%2FxzXnlU1LO.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM03%2FxzXnlU1LO.out?alt=media","contestCode":"SRM03","createdAt":{"$date":"2018-09-10T17:08:47.926Z"},"updatedAt":{"$date":"2019-07-14T07:35:06.06Z"},"__v":0}
,{"_id":{"$oid":"5b96a89fe701a900207872a6"},"code":"SRM03B","points":200,"name":"Predict Shambhavi","description":"It is the time of Cognition and Shambhavi has participated in N events numbered from 1 to N. Each of these events have a particular waiting time ( in minutes ), W(i) ( 1 <= i <= N ) for which Shambhavi has to wait for her turn in that event. However, Shambhavi doesn’t like to wait at a particular place. So she keeps moving from one event location to another, until her turn arrives.\r\n\r\nShambhavi starts visiting the events from the 1st event. \r\nIf Shambhavi is at the location of the ith ( 1 <= i <= N-1 ) event AND W(i) > 0, She will leave instantly and move to the next ( (i+1)th ) event location.\r\nIn case if i=N, she will move back to the 1st event location.\r\nIn case if Shambhavi is at the ith event location and W(i) = 0 , she will take her turn in that event. ( Here, W(i) = 0 indicates that the waiting time is over ).\r\nThe time taken by Shambhavi to move from any event location to another is exactly 1 minute.\r\n\r\nPredict the first event in which Shambhavi will enter.","explainInput":"The first line of the input consists of a single integer T, denoting the number of Test Cases.\r\nThe description of T test cases follow : \r\nThe first line of each test case consists of a single integer N.\r\nThe second line of each test cases consists of N space-separated integers W(i).","explainOutput":"For each test case, output a single line consisting of a single integer, the number of the first event in which Shambhavi will enter.","constraints":"1 <= T <= 100\r\n1 <= N <= 10^5\r\n0 <= W(i) <= 10^9\r\n","example":"Input:\r\n2\r\n4\r\n4 2 1 3\r\n6\r\n7 5 3 4 5 7\r\n\r\nOutput:\r\n3\r\n2","explanation":"Test Case 1 :\r\nInitial timings -> 4 2 1 3\r\nAfter Shambhavi moves from 1 to 2 -> 3 1 0 2\r\nAfter Shambhavi moves from 2 to 3 -> 2 0 0 1\r\nHere as W(i) = 0, Shambhavi enters the 3rd event first.","tags":["dp","math"],"inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM03%2Fk_SBukHkt.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM03%2Fk_SBukHkt.out?alt=media","contestCode":"SRM03","createdAt":{"$date":"2018-09-10T17:23:46.273Z"},"updatedAt":{"$date":"2018-11-11T14:24:41.51Z"},"__v":0}
,{"_id":{"$oid":"5b96a9e0e701a900207872a7"},"code":"SRM03C","points":250,"name":" Help Shweta to win The Matrix","description":"The Finals of the Cognition Matrix are started . Shweta being a clever girl, has solved all the questions of the finals. Hence, she requested for a bonus question.\r\n\r\nThe event head of The Matrix, Aditya Parthasarathy is very creative. He has given a string to Shweta ( all alphabets are lowercase ). \r\nLet us call a string ( length greater than or equal to 2 ) to be “alpha-ordered” if it consists of alphabets in the standard continuous alphabetical order. For e.g. abcd, jklmno, fg.\r\n\r\nFrom the given string, Shweta is supposed to find and delete all such alpha-ordered substrings.\r\nWhile solving this question, if Shweta spots 2 or more than 2 such substrings at the same time, she should delete the leftmost substring first, and then look for any other substrings to be deleted. \r\nThe final answer should not consist of any alpha-ordered substring. \r\n\r\nBut as we all know, Shweta loves to get her work done from others. So she has requested you to help her to win The Matrix. ","explainInput":"The first line of the input consists of a single integer N, denoting the number of strings given by Aditya.\r\nN lines follow :\r\nEach of these lines consists of a single string given by Aditya.","explainOutput":"For each of the ith given string ( 1 <= i <= N ), output the final answer ( final string ), to the corresponding given string in one single line. ","constraints":"1 <= N <= 100\r\n1 <= Input string length <= 1000\r\n( All input alphabets are lowercase )","example":"Input:\r\n3\r\nhiauvz\r\nabcd\r\nababcdc\r\n\r\nOutput:\r\naz\r\n\r\nc","explanation":"Test Case 2 :\r\nAs the whole string is alpha-ordered, the answer is an empty string\r\n\r\nTest Case 3 :\r\nString after deleting “ab” ->     abcdc\r\nString after deleting “abcd” ->     c\r\nFinal Answer ->     c","tags":["adhoc","strings"],"inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM03%2F6CYsEJtz8.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM03%2F6CYsEJtz8.out?alt=media","contestCode":"SRM03","createdAt":{"$date":"2018-09-10T17:29:05.322Z"},"updatedAt":{"$date":"2018-11-11T14:26:10.888Z"},"__v":0}
,{"_id":{"$oid":"5b9e444fc81946001f697c1d"},"code":"SEPT18E","points":100,"name":"Aarya Celebrates Dussehra","description":"Celebration of the festival of Dussehra in Bengal and eastern India is indeed unique. No other  festival anywhere can match the Pooja season in grandeur, rituals, expression of family bonds and sheer size of mass participation. Our friend Aarya is also excited for Dussehra this year. \r\n\r\nDuring Dussehra, all of her <b>N</b> family members join her. Out of these <b>N</b> family members only <b>M</b> know each other very well and they share about everything with each other.  We know these <b>N</b> distinct family members and also about their <b>M</b> strong bond and relationships.\r\n\r\nBut when all of these family members come together, one of the family member <b>S</b> starts a rumour. This is an yearly tradition. This year, Aarya wants to find out who will be the first person and the last person of the family to know. She also knows that <em><b>S</b> only tells this rumour to his friendly family members alphabetically and once S tells his first friendly family member that friendly family member tells his immediate first friendly family member alphabetically and it goes on simultaneously like fire.(here each of the family member tells the rumour to their immediate alphabetically first friendly family member, e.g. If A has bond with X Y Z, A will first tell it to X, then Y and then Z but will spread at the same time and be counted equally. But there is also a chance that X has a bond with C and C has a bond with Y then, in this case Y will receive rumour before it comes to him/her from A and will be counted last).</em>\r\nSince Aarya is busy in a lot of decoration work, she needs your help.\r\n\r\nHint: Rumour spreads like Depth First Fire.","explainInput":"The first line of the input is an integer <b>T</b>, denoting the number of test cases.\r\nEach test case starts with two integers denoting <b>N</b> and <b>M</b> as mentioned above.\r\nNext line contains <b>N</b> characters with a space between each of them denoting the family members.\r\nNext <b>M</b> lines contains <b>X</b> and <b>Y</b> two characters denoting a friendship among them.\r\nNext line contains <b>S</b> the character of the family member who starts the rumour.","explainOutput":"For each test case, output two characters <b>AX</b> and <b>AY</b> in a single line with a space\r\nbetween them. Here AX will be the first person to know the secret (also alphabetically\r\ntoo if there are multiple characters with the same time) and AY will be the last person to\r\nknow (also alphabetically last if there are multiple characters with same time).","constraints":"1 <= <b>T</b> <= 10.\r\n2 <= <b>N, M</b> <= 26\r\nAll characters are uppercase and in range from A to Z.\r\nX and Y will be any two characters from N given characters.","example":"<b>Input</b>:\r\n2\r\n4 4\r\nA B O Z\r\nA B\r\nA Z\r\nB Z\r\nB O\r\nO\r\n6 7\r\nA B C X Y Z\r\nA Z\r\nA X\r\nA Y\r\nY C\r\nX C\r\nX B\r\nB Z\r\nX\r\n<b>Output</b>:\r\nB Z\r\nA C","explanation":"<b>Case 1</b>:\r\n<center><img src=\"https://i.imgur.com/lttpzkn.png\" align=\"center\"></center>\r\nSecret is shared by O to B first.\r\nSo traversal is: B->A->Z. \r\nSo B is first and Z is last.\r\n<b>Case 2</b>:\r\n<center><img src=\"https://i.imgur.com/WyuhcYn.png\" align=\"center\"></center>\r\nSecret is shared by X to A first.\r\nSo traversal is: A->Y->C and A->Z->B. \r\nBoth Y and Z are reached at same time and B and C are reached at same time.\r\nBut alphabetically C comes next to B so C is the answer.\r\nSo A is first and C is last.","tags":["graphs","strings"],"inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSEPT18%2FBEofa-c9S.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSEPT18%2FBEofa-c9S.out?alt=media","contestCode":"SEPT18","createdAt":{"$date":"2018-09-16T11:53:51.51Z"},"updatedAt":{"$date":"2018-11-11T14:30:51.693Z"},"__v":0}
,{"_id":{"$oid":"5b9e5804c81946001f697c1e"},"code":"SEPT18A","points":100,"name":"Who Will Break The Handi?","description":"Amit, Bipin and Chetan are enjoying themselves in the festive mood of Janmashtami. They decide that they will participate in the Dahi Handi event organized in their city. However, only one of them can climb atop and break the ‘Handi’. Chetan is afraid of heights and doesn’t wish to climb atop. To help decide who should be the one to break the Handi, Chetan suggests a game of penalty shoot-out. Amit and Bipin will be the strikers and Chetan will be the goalkeeper.\r\nEnergy levels of Amit, Bipin and Chetan are denoted by <b>A</b>, <b>B</b> and <b>C</b> respectively. For every goal scored by Amit and Bipin, their energy decreases by 1. For every goal saved by Chetan, his energy decreases by 1. <em>Amit and Bipin can score goals only if Chetan’s energy is a factor of their energy, otherwise not. The game ends when Chetan’s energy reaches 1.</em>\r\nAssume that same player can repeatedly try for goals. Amit being the junior player is always favored for the penalty kick in case if both of them can score goals at the same time. The player who scores the most goals wins the game and will climb atop to break the Handi.\r\nFind who wins the game.\r\n\r\n","explainInput":"The first line of input contains an input <b>T</b> denoting the number of Test cases.\r\nEach test case contains 3 space-separated integers on the same line denoting the initial energy levels <b>A</b>, <b>B</b> & <b>C</b> respectively.\r\n","explainOutput":"For each Test Case, output who scored the most goals on a single line. Output “<b>Draw</b>” in case of a draw (Without the quotes).","constraints":"1<=<b>T</b><=100\r\n1<=<b>A, B, C</b><=10^5","example":"<b>Input</b>:\r\n2\r\n4 9 5\r\n13 10 7\r\n<b>Output</b>:\r\nA\r\nB","explanation":"<b>Case 1</b>:\r\nEnergy of Chetan is 5, which is not a factor of either 4 or 9. Thus Chetan saved the goal and his energy decreases by 1. Now, Chetan’s energy is 4, which is a factor of Amit’s energy 4. Amit scores a goal and his energy decreases by 1. This goes on until Chetan’s energy reaches 1. At this point, Amit has scored 3 goals and Bipin has scored 2 goals. Amit has won and we output <b>A</b>.","tags":["adhoc","math"],"inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSEPT18%2FQSGyrQD5r.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSEPT18%2FQSGyrQD5r.out?alt=media","contestCode":"SEPT18","createdAt":{"$date":"2018-09-16T13:17:57.219Z"},"updatedAt":{"$date":"2018-11-11T14:29:56.986Z"},"__v":0}
,{"_id":{"$oid":"5b9e5acec81946001f697c1f"},"code":"SEPT18B","points":100,"name":"Shweta And Her Rakhi","description":"On the eve of Rakshabandhan, Shweta wants to buy a Rakhi for her brother. She visits a shop and finds that there are <b>N</b> Rakhis of different sizes. The shopkeeper tells her that the cost  <b>C</b> of a Rakhi is <em>directly proportional</em> to its size. He also tells Shweta that the cost of all the Rakhis are <em>distinct</em>.\r\nShweta is finding it difficult to keep track of the cost of all the Rakhis. So she asks the shopkeeper to convert it into a reduced form, where the cost is reduced to the range <b>0</b> to <b>N-1</b>. The shopkeeper replaces the cost of cheapest Rakhi with 0, the next cheapest Rakhi with 1, and so on, the costliest Rakhi with N-1.\r\nFrom this reduced cost list of Rakhis, Shweta asks the shopkeeper to give her the <b>K<sup>th</sup></b> Rakhi.\r\nFind out what is the value of the Rakhi at <b>K<sup>th</sup></b> position in the reduced cost list.","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases.\r\nFor each test case, the first line contains 2 space-separated integers <b>N</b> & <b>K</b>. \r\nThe next line contains <b>N</b> space-separated elements, denoting the cost <b>C</b> of Rakhi.","explainOutput":"For each test case, output the value of the Rakhi at <b>K<sup>th</sup></b> position of the reduced form, in a single line.","constraints":"1<=<b>T, N</b><=100\r\n1<=<b>K</b><=N\r\n1<=<b>C</b><=1000","example":"<b>Input</b>:\r\n2\r\n3 2\r\n10 40 20\r\n5 3\r\n5 10 40 30 20\r\n<b>Output</b>:\r\n2\r\n4","explanation":"<b>Case 1</b>:\r\nThe cost of the cheapest Rakhi is 10 and that of costliest Rakhi is 40. Thus 10 is replaced by 0, 20 is replaced by 1 and 40 is replaced by 2. The reduced cost list is {0, 2, 1}. In this case, K=2. The number at 2nd position in this reduces list is 2.\r\n<b>Case 2</b>:\r\nSimilarly, the reduced cost list for this case is {0, 1, 4, 3, 2}. Here K=3. The number at 3rd position in this array is 4.","tags":["adhoc","math"],"inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSEPT18%2FnN4oDCqLA.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSEPT18%2FnN4oDCqLA.out?alt=media","contestCode":"SEPT18","createdAt":{"$date":"2018-09-16T13:29:50.891Z"},"updatedAt":{"$date":"2018-11-11T14:30:10.503Z"},"__v":0}
,{"_id":{"$oid":"5b9e5d0dc81946001f697c20"},"code":"SEPT18C","points":100,"name":"Vishal's Journey","description":"Vishal wants to visit his native place in Ratnagiri to celebrate the festival of Ganesh Chaturthi. He wants to book a railway ticket to Ratnagiri, but found that the queue at the railway stations are too long. He decided that he will book the tickets online. However, he has to register himself first.\r\nVishal needs a strong password to help finish his registration process. But, the online portal has certain conditions for validating the password. <em>The password is accepted as valid only if it follows the following set of rules</em>:\r\na. The length of the password should be between <b>8</b> & <b>20</b>, both inclusive\r\nb. The password should have at least <b>one lowercase character</b> (a-z)\r\nc. The password should have at least <b>one uppercase character</b> (A-Z)\r\nd. The password should have at least <b>one number</b> (0-9)\r\ne. The password should <b>not</b> start with a number\r\nHelp Vishal find out if his password is valid or not. Assume that <b>NO</b> special characters are used.\r\nOutput “<b>Valid</b>” if the password is valid and “<b>Invalid</b>” if it is invalid. (Do not print the quotes)","explainInput":"The first line of the input is an integer <b>T</b>, denoting the number of test cases\r\nThe next <b>T</b> lines contain a string, denoting Vishal’s password.","explainOutput":"<b>T</b> lines of output stating whether the given password is <b>Valid</b> or <b>Invalid</b>.","constraints":"1<=<b>T</b><=100\r\n1<=<b>String length</b><=50","example":"<b>Input</b>:\r\n4\r\nWelcome123\r\n123Welcome\r\nwelcome123\r\nWelc1\r\n<b>Output</b>:\r\nValid\r\nInvalid\r\nInvalid\r\nInvalid","explanation":"<b>Case 1</b>:\r\nAll the conditions for the password are satisfied. Hence, it is Valid.\r\n<b>Case 2</b>:\r\nThe password starts with a number. Hence, it is Invalid.\r\n<b>Case 3</b>:\r\nThe password doesn’t contain an uppercase character. Hence, it is Invalid.\r\n<b>Case 4</b>:\r\nThe length of the password is less than 8. Hence, it is invalid.","tags":["strings"],"inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSEPT18%2Fzg-Ly_YTp.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSEPT18%2Fzg-Ly_YTp.out?alt=media","contestCode":"SEPT18","createdAt":{"$date":"2018-09-16T13:39:25.715Z"},"updatedAt":{"$date":"2018-11-11T14:30:27.5Z"},"__v":0}
,{"_id":{"$oid":"5b9e6068888c06001ffabf9b"},"code":"SEPT18D","points":100,"name":"Nishant's Diwali Puzzle","description":"The Festival of Lights is here. Nishant wants to buy a new Lantern this Diwali. He visits your shop and finds that the lanterns are arranged arbitrarily. You inform Nishant that the cost <b>C</b> of the lanterns are <em>directly proportional</em> to their size. Nishant likes puzzles and wants you to solve one.\r\nNishant lists the cost of all the lanterns. He finds that the list has some consecutive sub-sequences of Even Numbers. He wants you to make a new list consisting of the maximum number from each consecutive sub-sequence of even numbers. He expects that you find the minimum number from this new list.\r\nIf you answer it correctly, Nishant will buy the lantern of that cost from your shop. If there are no even sub-sequences, Nishant expects <b>-1</b> as the answer.\r\nSolve Nishant’s puzzle to find the cost of the lantern he will buy.\r\n","explainInput":"The first line of the input is an integer <b>T</b> denoting the number of test cases.\r\nThe next <b>T</b> lines contain a sequence of space-separated integers denoting the cost <b>C</b> of lanterns.","explainOutput":"Output the cost of the lantern Nishant will buy, in a single line.","constraints":"1<=<b>T</b><=100\r\n1<=<b>C</b><=10^5","example":"<b>Input</b>:\r\n3\r\n3 4 6 5 12 6 18 14 9 11 10\r\n2 4 6 8 1 3 5 8 10 7 9 11 12 14 16\r\n1 3 5 7 9\r\n<b>Output</b>:\r\n6\r\n8\r\n-1","explanation":"<b>Case 1</b>:\r\nThe first even sub-sequence is {4, 6}. The maximum value in this sequence is 6. The next even sub-sequence is {12, 6, 18, 14}. The maximum value in this sequence is 18. The next even sub- sequence is {10}. The maximum value in this sequence is 10. Now, the new list of maximum values from each even sub-sequence is {6, 18, 10}. The minimum value in this new list is 6.\r\n<b>Case 2</b>:\r\nThe first even sub-sequence is {2, 4, 6, 8}. The maximum value in this sequence is 8. The next even sub-sequence is {8, 10}. The maximum value in this sequence is 10. The next even sub-sequence is {12, 14, 16}. The maximum value in this sequence is 16.  Now, the new list of maximum values from each even sub-sequence is {8, 10, 16}. The minimum value in this new list is 8.\r\n<b>Case 3</b>:\r\nAs there are no even terms in the sequence, we output -1","tags":["adhoc","math"],"inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSEPT18%2FpmMYhT8S6.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSEPT18%2FpmMYhT8S6.out?alt=media","contestCode":"SEPT18","createdAt":{"$date":"2018-09-16T13:53:46.132Z"},"updatedAt":{"$date":"2018-11-11T14:30:38.969Z"},"__v":0}
,{"_id":{"$oid":"5bae773afda1fc0021bbf24a"},"tags":["math"],"code":"SRM04A","points":100,"name":"Cibin Challenges Harsh","description":"One fine day, Cibin was challenged by one of his peers to play this virtual game called “Skull Crusher”. Harsh is a gaming addict. He spends most of his time playing games. Cibin and Harsh are close friends. So, Cibin wanted to challenge Harsh to play the game. But since Harsh is a professional gamer, Cibin decided to give him a tougher task.\r\n            \r\nCibin will give him the minimum required points X. He has to get a minimum of X points in order to win the challenge.\r\nIn order to win this game, there will be exactly 5 trials, namely t1, t2, t3, t4, t5. If the sum of the points of these trials is greater than or equal to X, Harsh will win the challenge. Or else, he loses the Challenge. \r\n            \r\nBut since Harsh is passionate towards gaming, he wants to know the minimum points he will need to score in order to pass the given points X. \r\n \r\nThe minimum extra points that has to be scored in order to get the overall score equal to X are M. M are the extra points he needs to increase in the highest score of that attempt. \r\n","explainInput":"The first line of input contains an integer T denoting the number of test cases. Each test case consists of two lines.  \r\nThe first line of each test case consists of a single integer X.\r\nThe second line of each test case consists of five space-separated integers t1 t2 t3 t4 t5 denoting the score of each trial.\r\n","explainOutput":"For each test case, output the answer in one single line.\r\nIf the total score is strictly less than X, output M, which is the required additional score in the total score in order to win the challenge. \r\nOr else output “Harsh Wins” (without quotation mark).\r\n","constraints":"1 <= T <= 100   \r\n1 <= X <= 10^5 \r\n-10^5 <= t1, t2, t3, t4, t5 <= 10^5\r\n","example":"Input: \r\n2\r\n35\r\n-1 -2 4 6 7                \r\n2 \r\n2 5 7 1 7\r\n\r\nOutput: \r\n21 \r\nHarsh Wins\r\n","explanation":"Test case 1 :\r\nTotal score is 14 < 35. So, in order to get minimum score(35), we need to add 21.\r\n  \r\n","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM04%2Fz1pNju9qz.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM04%2Fz1pNju9qz.out?alt=media","contestCode":"SRM04","createdAt":{"$date":"2018-09-28T18:47:22.425Z"},"updatedAt":{"$date":"2018-11-11T14:27:18.062Z"},"__v":0}
,{"_id":{"$oid":"5bae7910fda1fc0021bbf24b"},"tags":["strings","sorting"],"code":"SRM04B","points":200,"name":"Chopper Challenge","description":"Mithil has escaped the villain's lair in a chopper trying to get to the city centre, but while flying over the city to get to the destination, the engines of the chopper fail, and he starts to fall. To avoid crashing, he needs to decrease the weight in the chopper.At to the back end of the chopper, he finds massive crates with labels of their weights. To make the task harder, the villain has labelled the weights as lettered digits (For ex- 234= two three four). To save the chopper from falling into the city and causing damage, Mithil needs to push out crates in\r\ndecreasing order of their weights, ie- the heaviest crates going out first. Help Mithil find the order in which he needs to push the crates out.\r\n","explainInput":"The first line of input contain an integer T denoting the number of test cases. Each test case consists of 1 line, which has comma separated distinct weights of each crate with the line ending in a period.\r\n","explainOutput":"For each test case, output a single line with spaced integers giving the index of weights to be pushed out in order.\r\n\r\n","constraints":"1 <= Test cases<= 100\r\n1 <= number of boxes <= 100\r\n100 <= weight <= 999\r\n","example":"Input:\r\n2\r\nthree four two, eight nine two, seven six eight.\r\nfour two zero, six nine three.\r\n\r\nOutput:\r\n2 3 1\r\n2 1\r\n","explanation":"In the first case, the weights were 342, 892 and 768 in order. The heaviest crate is “892” which is at index “2” followed by “768” which is at index “3” and then “342” which is at index “1”. Hence the order of the position of the weights to be pushed is 2 3 1.\r\n\r\nIn the second case, the weights were 420, 693 in order. The heaviest crate is “693” which is at index “2” followed by “420” which is at index “1”. Hence the order of the position of the weights to be pushed is 2 1.\r\n\r\nNote: No weight is repeated in a single test case.\r\n","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM04%2FKdpkfKwqp.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM04%2FKdpkfKwqp.out?alt=media","contestCode":"SRM04","createdAt":{"$date":"2018-09-28T18:55:12.897Z"},"updatedAt":{"$date":"2018-11-11T14:28:14.587Z"},"__v":0}
,{"_id":{"$oid":"5bae7e94fda1fc0021bbf24c"},"tags":["binary search"],"code":"SRM04C","points":300,"name":"Ghost Game","description":"Aman is playing a computer game in which, he is inside a haunted building consisting of N floors.\r\n\r\nIn order to win the game, he is supposed to reach to the top of the building with the help of the staircases. But while climbing the staircases, everytime he hears a ghost scream, he is supposed to run to the closest floor to him from his current position at that time. In case if both the lower and the upper floors are at an equal distance from him, he dies and the game ends.\r\n\r\nAman knows the number of stairs between each two floors and the total number of stairs he has climbed so far before hearing the ghost scream.\r\nHelp him to find the closest floor to him or determine whether the game ends.\r\n\r\n","explainInput":"The first line of the input consists of a single integer T denoting the number of test cases.\r\nThe description of T test cases follow :\r\n\r\nThe first line of each test case consists of a single integer N denoting the number of floors.\r\n\r\nThe second line of each test case consists of N space-separated integers. \r\nThe ith ( 1 <= i <= N ) of these integers represent the number of stairs between the (i-1)th and the ith floor. \r\n( 0th floor represents the ground floor )\r\n\r\nThe third line of each test cases consists of a single integer Q denoting the number of queries. \r\nQ lines follow :\r\nEach of these lines consists of a single integer S denoting the total number of stairs Aman has climbed so far before hearing the ghost scream.\r\n\r\n\r\n","explainOutput":"For each test case, Output Q lines.\r\nEach of these Q lines should consist of the answer to the corresponding query, which is the closest floor number.\r\nIn case if both the lower and the upper floors are at an equal distance from Aman, print “game over” in a single line. \r\n\r\n","constraints":"1 <= T <= 5\r\n1 <= N <= 10^6\r\n1 <= Q <= 10^5\r\n1 <= Number of stairs between each two floors <= 10^9\r\n1 <= S <= Total number of stairs in the building <= 10^14\r\n","example":"Input:\r\n1\r\n4\r\n2 6 3 4\r\n3\r\n5\r\n10\r\n6\r\n\r\nOutput:\r\n1\r\ngame over\r\n2\r\n","explanation":"Test Case 1 :\r\nThe building has 4 floors.\r\nNo. of stairs between 0th and 1st floor -> 2\r\nNo. of stairs between 1st and 2nd floor -> 6\r\nNo. of stairs between 2nd and 3rd floor -> 3\r\nNo. of stairs between 3rd and 4th floor -> 4\r\n\r\nNumber of Queries - 3\r\nQuery - 1 :\r\nS = 5\r\nTherefore, Aman is on the 3rd step between 1st and 2nd floor.\r\nSo he is closest to 1st floor.\r\nQuery - 2 :\r\nS = 10\r\nTherefore, Aman is on the 2nd step between 2nd and 3rd floor.\r\nSo he is equally distant from both the floors, hence game ends.\r\nQuery - 3 :\r\nS = 6\r\nTherefore, Aman is on the 4th step between 1st and 2nd floor.\r\nSo he is closest to 2nd floor.\r\n\r\n\r\n","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM04%2F6MX7Wys0x.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM04%2F6MX7Wys0x.out?alt=media","contestCode":"SRM04","createdAt":{"$date":"2018-09-28T19:18:49.838Z"},"updatedAt":{"$date":"2018-11-11T14:29:35.073Z"},"__v":0}
,{"_id":{"$oid":"5c2c5ac54ed5920022b4ae89"},"tags":["graphs"],"code":"SRM05C","points":300,"name":"Installation of OS in New Computers","description":"In a new laboratory all the computers are brand new and these are not having any operating system installed in them. So, again Cibin took the initiative to install them in all the computers, but there is a twist. \r\n\r\nThe computers are connected to form a network and no two computers connected directly should have same type of OS. For example, if computer 1 is directly connected to computer 3 then both shouldn’t have Windows but one should have Linux. \r\n\r\nNow let us consider that there are <b>N</b> computers starting from <em>1 to N</em> and <b>C</b> direct connections between them. We have to assume that the first computer will need Linux installed in it. If the above condition is possible then Cibin need to print <b>yes</b> otherwise he should print <b>no</b>.","explainInput":"The first line of input contain an integer T denoting the number of test cases. For each test case, the first line contains N i.e the number of computers and C i.e the number of connections. The next C lines contains the connections. (Example: 1 3 , 2 4 etc)","explainOutput":"For each test case, output a single line containing yes or no.","constraints":"1 <= T <= 100\r\n1 <= N <= 10^3\r\n0 <= C <= 10^3","example":"Input:\r\n3\r\n4 4\r\n1 3\r\n1 4\r\n2 3\r\n2 4\r\n4 6\r\n1 2\r\n1 3\r\n1 4\r\n2 3\r\n2 4\r\n3 4\r\n5 6\r\n1 3\r\n1 4\r\n1 5\r\n2 3\r\n2 4\r\n2 5\r\n\r\nOutput:\r\nyes\r\nno\r\nyes","explanation":"CASE 1:\r\n<img src=\"https://i.imgur.com/7QUVERc.jpg\" />\r\nCASE 2:\r\nIn this case, it is not possible to install different OS on adjacent computers.\r\nCASE 3:\r\n<img src=\"https://i.imgur.com/ejjqU3u.jpg\" />","contestCode":"SRM05","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM05%2FcmLv3XTRu.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM05%2FcmLv3XTRu.out?alt=media","createdAt":{"$date":"2019-01-02T06:31:33.934Z"},"updatedAt":{"$date":"2019-01-06T06:00:58.635Z"},"__v":0}
,{"_id":{"$oid":"5c2c5c6cec9f5000224eef12"},"tags":["adhoc","strings"],"code":"SRM05B","points":200,"name":"Cibin is confused between IPv4 and IPv6","description":"Its the subject Computer Networks and Cibin is confused between Ipv4 and Ipv6 addresses. His teacher solved his doubts and taught him about both.\r\n\r\nFollowing were the points his teacher covered about Ipv4 addresses:\r\n    • An  IPv4 address has the following format: x . x . x . x where x  is called an octet  and must be a decimal value between 0 and 255. Octets are separated by periods. An IPv4 address must contain three periods and four octets.\r\n    • No period should start with 0 unless the period has single digit.\r\n    • The following examples are valid Ipv4 Addresses:\r\n192.168.0.1\r\n10.0.0.5\r\n1.2.3.4\r\n\r\nFollowing were the points his teacher covered about Ipv6 addresses:\r\n    • In IPv6, addresses are expressed as a series of eight 4-character hexadecimal numbers, which represent 16 bits each (for a total of 128 bits).\r\n    • Leading zeroes MUST be suppressed. For example, 1:08:1:2:3:01:ab:5 is not acceptable and must be represented as  1:8:1:2:3:1:ab:5\r\n    • The characters \"a\", \"b\", \"c\", \"d\", \"e\", and \"f\" in an IPv6 address MUST be represented in lowercase.\r\n    • The following examples are valid Ipv6 Addresses:\r\n3:ed2:5c0:d0ab:ef:9:2:f\r\n2001:db8:0:1:1:1:1:1\r\nNow, his teacher wants to check how much Cibin learnt from his efforts by taking a short assessment test.","explainInput":"The first line of input contain an integer T denoting the number of test cases. Each test case consists of one line, which contains a string of address.","explainOutput":"For each test case, output a single line output as ipv4 / ipv6 / invalid.","constraints":"1 <= T <= 100","example":"Input:\r\n4\r\n192.168.43.75\r\n2001:DB8:0111:2:1:1:1001:2008\r\n2001:db8:1234:5678:2:1:56:45\r\n192.168.AB.CD\r\n\r\nOutput:\r\nipv4\r\ninvalid\r\nipv6\r\ninvalid","explanation":"In test case 1, the address is a valid IPv4 address.\r\nIn test case 2, capital letters are used and 0 is not suppressed which makes it invalid IPv6 address.\r\nIn test case 3, the address is a valid IPv6 address.\r\nIn test case 4, the address is not a valid IPv4 address due to the usage of alphabets.","contestCode":"SRM05","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM05%2FewJxJ-euG.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM05%2FewJxJ-euG.out?alt=media","createdAt":{"$date":"2019-01-02T06:38:36.376Z"},"updatedAt":{"$date":"2019-01-06T14:32:02.86Z"},"__v":0}
,{"_id":{"$oid":"5c2c5e61ec9f5000224eef13"},"tags":["adhoc"," math"],"code":"SRM05A","points":100,"name":"Cibin Likes Networking","description":"Its a practical session of Computer Networks. Unlike other practical sessions, this one is interesting. Today the professor asked Cibin to establish a wired <b>Star Topology</b> network between all the PCs where the central PC is that of the professor.\r\nNow, if you don’t know the star topology network, it is basically a network in which there is a central PC which is connected to all the others PCs in the network. As assisted by the professor, after 150m, there is a need of repeater.\r\nThere are total <b>N</b> PCs including the central PC. The total available wire length is <b>L</b> and the total no. of available repeaters are <b>R</b>.","explainInput":"The first line of input contain an integer T denoting the number of test cases. Each test case consists of two lines. The first line contains three numbers viz total no. of PCs N, the available no. of repeaters R and available length of wire L. The second line contains (N-1) numbers K1,K2,K3….Kn-1 i.e the lengths of the other PCs from the central PC.\r\n","explainOutput":"For each test case, if the wire and repeaters are sufficient to establish the star topology then print sufficient otherwise print insufficient.","constraints":"1 <= T <= 100\r\n3 <= N <= 50\r\n1 <= L <= 100000\r\n1 <= R <= 100\r\n1 <= Ki <= 1000","example":"Input:\r\n3\r\n7 3 550\r\n90 70 170 45 195 70\r\n10 5 1500\r\n175 200 45 95 35 180 170 100 120\r\n8 2 1000\r\n170 50 190 50 230 100 120\r\n\r\nOutput:\r\ninsufficient\r\nsufficient\r\ninsufficient","explanation":"For the first test case, the total wire length required is 640 but available wire length is 550.\r\nFor the second test case, the wire and the no. of repeaters both are sufficient.\r\nFor the third test case, the wire length is sufficient but the available no. of repeaters is not enough.","contestCode":"SRM05","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM05%2F__xo7xktN.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM05%2F__xo7xktN.out?alt=media","createdAt":{"$date":"2019-01-02T06:46:57.933Z"},"updatedAt":{"$date":"2019-01-06T17:05:38.611Z"},"__v":0}
,{"_id":{"$oid":"5c2cd2eee3e5da002279017e"},"tags":["adhoc, strings"],"code":"SRM06A","points":100,"name":"Fifteen Million Merits","description":"In the near future, most of the society must cycle on exercise bikes in order to earn currency called <b>Merits</b>. Bing is an aspiring dancer, who wishes to be featured on the show <b>Hot Shot</b>, a reality contest where winners are able to forgo the bike riding and live luxuriously. The entry fee for it is <b>M</b> Merits.\r\n\r\nEach session of cycling, (denoted by <b>C</b>) earns Bing <em>2000</em> Merits. Every time he rests (denoted by <b>R</b>), he loses <em>500</em> Merits. To keep him energized throughout his journey, he has to spend <em>200</em> Merits on food (denoted by <b>F</b>). \r\n\r\nBing initially has <em>0 Merits</em> with him. Merits shall be deducted (as mentioned above) even if there’s no credit spare (<em>negative credits</em>).\r\n \r\nYou are given a string describing Bing’s routine (denoted by <b>S</b>). Can he make it to <b>Hot Shot</b>?","explainInput":"The first line of input contains an integer T denoting the number of test cases. \r\nEach test case consists of two lines; the first line is a string <b>S</b> and the next line contains an integer <b>M</b>.  ","explainOutput":"For each test case, output a single line with the string <b>yes</b> or <b>no</b>.","constraints":"1 &le; T &le; 100\r\n0 &le; M &le; 10<sup>6</sup>\r\n","example":"Input:\r\n3\r\nCCCFCRR\r\n5000\r\nCCFFFRRRC\r\n10000\r\nRRFFFFFC\r\n30000\r\n\r\nOutput:\r\nyes\r\nno\r\nno\r\n","explanation":"Case 1:\r\nHere, the total amount of merits left with Bing, after the deductions, is 6800, which is greater than the entry fee M. \r\n\r\nCase 2:\r\nHere, the total amount of merits left with Bing, after deductions, is 3900, which is lesser than the entry fee M.\r\n\r\nCase 3:\r\nHere, the total amount of merits left with Bing, after deductions, is -1000, which is lesser than the entry fee M.","contestCode":"SRM06","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM06%2F0bg3xtiQh.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM06%2F0bg3xtiQh.out?alt=media","createdAt":{"$date":"2019-01-02T15:04:14.63Z"},"updatedAt":{"$date":"2019-01-12T13:30:44.659Z"},"__v":0}
,{"_id":{"$oid":"5c2dadc092a9930022a9dc85"},"tags":["adhoc, maths"],"code":"SRM06B","points":200,"name":"The National Anthem","description":"British prime minister Michael Callow is woken during the night to learn that Princess Susannah, a much-loved member of the Royal Family, has been kidnapped. For her safe return, the kidnappers demand that the Prime Minister must obtain a unique number <b>S</b>. The number can be obtained by performing the steps given below:\r\n\r\nSay there are <b>N</b> numbers say <b>A<sub></b><b>1</sub></b>, <b>A<sub></b><b>2</b?</sub>,.....,<b>A</b><sub><b>N</b></sub></b>.\r\nThe prime minister has to make all of the numbers distinct. In order to do that, he can perform the following operation zero or more times:\r\n            <ul><li> Take any two numbers, say <b>x</b> and <b>y</b> from the given numbers.\r\n            <li> The value of <b>x</b> shall remain as it is while the value of <b>y</b> is replaced by the sum <b>x</b> + <b>y</b>.\r\n</ul>\r\n\r\n<b>The special number is obtained by the addition of the minimum number of times the operation is required to be performed for each test case</b>. Help Michael Callow rescue the beloved princess.\r\n","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases. \r\nThe next line contains an integer<b> N</b>.\r\nThe next line contains <b>N</b> space separated integers (A<sub>1</sub>, A<sub>2</sub>,.....A<sub>N</sub>).","explainOutput":"Print <b>0</b> for those test cases where there is no operation performed.\r\nFinally, on the last line, output the unique number <b>S</b>.","constraints":"1 &le; T &le; 10\r\n1 &le; N &le; 100000\r\nFor each valid <em>i</em>, 1 &le; A<sub>i</sub> &le; 10<sup>6</sup>","example":"Input:\r\n4\r\n3 \r\n1 2 3\r\n3\r\n2 1 2\r\n4\r\n6 9 7 10\r\n5\r\n1 2 6 3 3\r\n\r\nOutput:\r\n0\r\n0\r\n2\r\n","explanation":"Case 1:\r\nNo two numbers are the same. Therefore, number of times the operation is to be performed = 0. Hence, the output is ‘0’.\r\n\r\nCase 2:\r\nTake the second number (with value x = 1) and add it to the first number (with value x = 2). After adding, the sequence will be 3 1 2. Now the numbers are distinct. Therefore, minimum number of mixing operations that are required = 1.\r\n\r\nCase 3:\r\nNo two numbers are the same. Therefore, number of times the operation is to be performed = 0. Hence, the output is ‘0’.\r\n\r\nCase 4:\r\nTake the fourth number (with value x = 3) and add it to the first number (with value x = 1). After adding, the sequence will be 1 2 6 4 3. Now the numbers are distinct. Therefore, minimum number of mixing operations that are required = 1.\r\n\r\nTherefore, the unique number is = 0 + 1 + 0 + 1 = 2, and is printed on the final line.\r\n","contestCode":"SRM06","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM06%2FPs2yHspK2.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM06%2FPs2yHspK2.out?alt=media","createdAt":{"$date":"2019-01-03T06:37:52.446Z"},"updatedAt":{"$date":"2019-01-13T04:01:00.498Z"},"__v":0}
,{"_id":{"$oid":"5c2daf4992a9930022a9dc86"},"tags":["maths, greedy"],"code":"SRM06C","points":250,"name":"White Bear","description":"An unknown signal began appearing on television and mobile phone screens, turning most people of the city of White Bear into passive citizens, but you and Jem are unaffected. You find out there are several transmitters and receivers placed all over the city responsible for this unknown signal. Both of you have decided to intercept the signal to stop this madness.\r\n\r\nThere are <b>M</b> transmitter-receiver pairs. The signals are being transmitted from the transmitter to the receiver, and the transmissions are parallel to the x-axis. The <b>x</b> coordinates of the each transmitter-receiver pair is denoted by <b>x1</b> and <b>x2</b> respectively, and each pair has a distinct <b>y</b> coordinate. To stop the transmission, you must transmit a ‘network-jamming’ signal, intercepting the signal transmitted by the transmitter-receiver pairs (the intercept can be made at the points <b>x1</b> and <b>x2</b> too) . Assume that the range of this ‘network-jamming’ signal is infinite and can intercept multiple transmissions at once. <b>(Refer diagram for better understanding.)</b>      \r\n\r\nDetermine the least number of interceptions to be made to disrupt all the transmissions.\r\n\r\n<center><img src=\"https://i.imgur.com/Cc1BmmJ.jpg\" width=\"80%\" align=\"center\"></center> ","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases. \r\nThe next line contains integer <b>M</b>, the number of transmitter-receiver pairs.\r\nThe next <b>M</b> lines contain two space separated integers <em>x<sub>1</sub></em> and <em>x<sub>2</sub></em>.","explainOutput":"For each test case, the output is an integer <b>N</b>, i.e., least number of intercepts to be made.","constraints":"1 &le; T &le; 10\r\n1 &le; M &le; 500\r\n0 &le; |x1| &le; |x2| &le; 5000\r\n","example":"Input:\r\n3\r\n3\r\n0 2\r\n2 4\r\n3 5\r\n3\r\n1 10\r\n11 15\r\n16 18\r\n5\r\n0 5\r\n5 10\r\n11 15\r\n0 2\r\n1 3\r\n\r\nOutput:\r\n2\r\n3\r\n3\r\n","explanation":"Case 1:\r\nHere, an intercept is made at x = 2, disrupting two of the transmitter receiver pairs. Another intercept is made at x = 5, to disrupt the remaining transmitter-receiver pair.\r\nHence, the total number of interceptions to be made = 2.\r\n\r\nCase 2:\r\nHere, three separate intercepts are required; the first intercept is made anywhere in between x = 1 and x = 10, the second intercept is made anywhere in between x = 11 to x = 15, and the third one is made anywhere in between x = 16 to x = 18.\r\nHence, the total number of interceptions to be made = 3.\r\n\r\nCase 3:\r\nHere, an intercept is made at x = 2, disrupting three of the transmitter receiver pairs. An intercept is made at x = 7, to disrupt a transmitter-receiver pair. Another intercept is made at x = 12, to disrupt the remaining transmitter-receiver pair.\r\nHence, the total number of interceptions to be made = 3.\r\n","contestCode":"SRM06","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM06%2Fcxev-htJh.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM06%2Fcxev-htJh.out?alt=media","createdAt":{"$date":"2019-01-03T06:44:25.317Z"},"updatedAt":{"$date":"2019-01-13T14:24:38.195Z"},"__v":0}
,{"_id":{"$oid":"5c39eca03646190022847c54"},"tags":["cakewalk"],"code":"UNI02","points":0,"name":"Odd or Even","description":"In this problem, you need to take input for 'n' numbers or integers and output their parity by printing 'O' for odd and 'E' for even on a single line.","explainInput":"First line of input contains T - the number of test cases. Next lines will be 'T' sets with 2 lines of input.\r\nFirst line of the set contains an integer which will indicate the number of integers to be processed in a case followed by 'n' space separated integers, a<sub>i</sub> with 1<=i<=n on next line. ","explainOutput":"For each number to be verified, print 'O' if it is odd and 'E' if it is even.","constraints":"1<=T<=100\r\n1<=n<=100\r\n1<=a[i]<=1000","example":"<b>Input:</b>\r\n2\r\n3\r\n2 4 5\r\n5\r\n10 3 1 8 9\r\n<b>Output:</b>\r\nEEOEOOEO","explanation":"We read the first line of input and know that the test is to be done twice. We then read the next line for the number of integers to be processed in each set and output its parity as mentioned.","contestCode":"UNIVERSE","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FUNIVERSE%2Fx28ZgcI3i.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FUNIVERSE%2Fx28ZgcI3i.out?alt=media","createdAt":{"$date":"2019-01-12T13:33:20.681Z"},"updatedAt":{"$date":"2019-01-28T15:08:40.556Z"},"__v":0}
,{"_id":{"$oid":"5c39ed573646190022847c59"},"tags":["cakewalk "],"code":"UNI04","points":0,"name":"Tug Of War","description":"SIES GST is hosting annual Tug of war competition you are making some predictions you know the power levels of the competitors now you have decided to write a program to find out the winning team.","explainInput":"The first line contains  T numbers of test case.\r\nThe second line of input contain an integer t denoting the players per team. \r\na[1],a[2],a[3]...... is the power of each player of team is given alternatively.\r\n[\r\nFor example-\r\n3\r\na b c d e f\r\na c and f are of team 1\r\nb d and e are of team 2\r\n]","explainOutput":"If team 1 wins print 1 \r\nif team 2 wins print 2 \r\nIf match ends in a draw print 0","constraints":"1<=T<=100\r\n1<=a[i]<=100","example":"<b>Input:</b>\r\n2\r\n4\r\n2 3 4 6 7 9 8 10\r\n2\r\n1 1 1 1\r\n2\r\n3 4 5 3 \r\n<b>Output:</b>\r\n201","explanation":"Team 1`s power was 21 and Team 2`s power was 28 since team 2 was powerful Team 2 won in first case.","contestCode":"UNIVERSE","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FUNIVERSE%2FMYZCdfnaf.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FUNIVERSE%2FMYZCdfnaf.out?alt=media","createdAt":{"$date":"2019-01-12T13:36:23.767Z"},"updatedAt":{"$date":"2019-01-15T18:01:42.19Z"},"__v":0}
,{"_id":{"$oid":"5c39f0543646190022847c61"},"tags":["cakewalk"],"code":"UNI03","points":0,"name":"Vowel Shovel","description":"Rohit : “Have you read about Sinbad the Sailor? What a man of pride!”\r\nMithil:  “Oh yes! I know, he also had one chapter where he uses this weapon by which he destroys all those vowels right! What was it called?”\r\nBarath: “The ‘vowel shovel’! “\r\nRohit: “Stop watching Doraemon guys.”\r\nMithil: “Oh so you say you can also get one?”\r\nRohit: “I can make one”\r\nHelp Rohit to make a vowel shovel using the power of programming.","explainInput":"The first line of input contain an integer T denoting the number of test cases. Each test case consists of one line, which contains the string str to be processed.","explainOutput":"For each test case, output a single line with the string which is free of vowels.","constraints":"1<=T<= 100\r\nstr[i] = {a, b, c, d, e, …., x ,y, z}","example":"<b>Input:</b>\r\n4\r\nmithil\r\nbarath\r\naieee\r\nrhythm\r\n<b>Output:</b>\r\nmthl\r\nbrth\r\n\r\nrhythm","explanation":"We have 4 words here.After removal of vowels the desired output is obtained. The 3rd case 'aieee' has all vowels hence a blank is printed.","contestCode":"UNIVERSE","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FUNIVERSE%2FVNrwzs2Ck.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FUNIVERSE%2FVNrwzs2Ck.out?alt=media","createdAt":{"$date":"2019-01-12T13:49:08.746Z"},"updatedAt":{"$date":"2019-01-12T14:26:49.756Z"},"__v":0}
,{"_id":{"$oid":"5c39f1023646190022847c62"},"tags":["Math"],"code":"UNI05","points":0,"name":"Distance Finder","description":"Find the distance between two points.","explainInput":"The first line of input contain an integer T denoting the number of test cases. Each test case consists of one line, which contains 2 points in the format (x1, y1) (x2, y2).","explainOutput":"Print the distance between the points (upto 2 decimal places) on new line.\r\n","constraints":"1 <= T<= 100\r\nx1, y1, x2, y2 will be integers.\r\nDistance can be a floating value.","example":"Input:\r\n2\r\n(1,2) (2,3)\r\n(0,0) (-1,0)\r\nOutput:\r\n1.41\r\n1.00","explanation":"1) Our coordinates are x1=1,y1=2,x2=2,y2=3. We calculate the distance between these points by known methods one of which is using Euclidean distance formula, √((x2-x1)2+(y2-y1)2). ","contestCode":"UNIVERSE","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FUNIVERSE%2FJ6ZepLphg.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FUNIVERSE%2FJ6ZepLphg.out?alt=media","createdAt":{"$date":"2019-01-12T13:52:02.344Z"},"updatedAt":{"$date":"2019-01-12T14:04:05.37Z"},"__v":0}
,{"_id":{"$oid":"5c39f4af80aaed0022b63275"},"tags":["string","math"],"code":"UNI06","points":0,"name":"Time Never Stops","description":"Mithil has used up a lot of his time coding. Now he has realised he is running out of time for exam preparation! Mithil has calculated some geeky stuff and says he could probably fix it all! He wants to be very precise here, can you help him know the exact amount of time (in seconds) left for the exam to start?","explainInput":"First line consist of number of test cases. Each case will have current time and exam time on 2 lines. Time is in 24 hours format HH:MM .","explainOutput":"Print the time left in seconds on new line.","constraints":"0<=HH<=24\r\n0<=MM<=60","example":"Input:\r\n1\r\n13:06\r\n14:02\r\nOutput:\r\n3360","explanation":"Current time is 13:06 and exam time is 14:02 which has 56 minutes in between. That is, 3360 seconds.","contestCode":"UNIVERSE","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FUNIVERSE%2FuJuzAZj8z.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FUNIVERSE%2FuJuzAZj8z.out?alt=media","createdAt":{"$date":"2019-01-12T14:07:43.101Z"},"updatedAt":{"$date":"2019-01-12T14:20:52.496Z"},"__v":0}
,{"_id":{"$oid":"5c4ae1bc91b74800225c106d"},"tags":["math","sorting"],"code":"SRM07A","points":100,"name":"Declaring Winners","description":"ByteCamp2019 judges have allotted scores to every team based on their performance in working prototype(X1), abstract level(X2), abstract scalability(X3) and Question-answer round(X4). They have decided to declare 3 winning teams (First, Second and Third).\r\nNow to declare winners, the judges have to go through scores of all the rounds of each team and declare the top 3 winners (from total of score). Help them to go through the scores of each team and declare winner for the ByteCamp2019.","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases.\r\nFirst line of each test case contains <b>N</b> denoting number of teams.\r\nNext 4 lines contains the scores of the teams of each round (<b>X1,X2,X3,X4</b>)  in the increasing order of team number.","explainOutput":"For each test case output a single line containing 3 space separated Team numbers (first, second and then third).\r\nIf total score of team matches with other team declare winner according to their score given in prototype round(<b>X1</b>).     \r\n<b> Note : No line should end with an extra space </b>","constraints":"T <= 100\r\nN <= 50\r\n0 <= X1,X2,X3,X4 <= 100\r\nX1[i] != X1[j]","example":"Input:\r\n1\r\n5\r\n7 4 8 3 4\r\n5 2 3 4 5\r\n5 3 4 5 6\r\n8 6 4 2 1\r\nOutput:\r\n1 3 5","explanation":"Team 1 is first. (7+5+5+8=25)\r\nTeam 3 is second. (8+3+4+4=19)\r\nTeam 5 is third. (4+5+6+1=16) ","contestCode":"SRM07","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM07%2Fcz09svA4h.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM07%2Fcz09svA4h.out?alt=media","createdAt":{"$date":"2019-01-25T10:15:24.367Z"},"updatedAt":{"$date":"2019-01-27T11:14:03.718Z"},"__v":0}
,{"_id":{"$oid":"5c4ae2fd91b74800225c106e"},"tags":["math"],"code":"SRM07B","points":200,"name":"Nap, hack, repeat.","description":"Venky, Sarthak and Sanoop have decided to participate in ByteCamp2019. They have to finish their hack within the time limit of 24 hours. As working continuously may tire them, they decided that at any given time one of them would take nap while other two will work. \r\nSo they have come up with list of timestamps and the name of person who would start napping. Venky, Sarthak and Sanoop can finish the entire work individually by X1, X2 and X3 hours respectively. Help them decide if they can complete their hack within 24 hours from start. Assume hackathon to start at 00:00 and that same person may nap again.","explainInput":"The first line of input contain an integer <b>T</b> denoting the number of test cases. \r\nFirst line of each test case contains <b>N</b> denoting number of timestamps.\r\nIt is followed by a line containing 3 space separated integers <b>X1,X2</b> and <b>X3</b>.\r\nNext N lines of each test case contain time stamp(properly ordered) and name separated by space.\r\nTime stamp is in HH:MM  (24hours) format.","explainOutput":"For each test case, output a single line with:\r\n“Successful Hack”(without quotes) if the list is feasible.\r\n“Oopsie Dopsie”(without quotes) for all other conditions.","constraints":"0 < T < 101\r\n\r\n0 < N < 21\r\n\r\n0 < X1,X2,X3 < 1000","example":"Input:\r\n2\r\n4\r\n310 409 560\r\n00:00 Sanoop\r\n04:25 Venky\r\n13:36 Venky\r\n19:08 Sarthak\r\n4\r\n24 28 20\r\n00:00 Sarthak\r\n02:00 Venky\r\n15:40 Sarthak\r\n23:08 Sanoop\r\n\r\nOutput:\r\nOopsie Dopsie\r\nSuccessful Hack","explanation":"Test Case 1:\r\nThey are not able to complete 100% of the work.\r\n\r\nTest Case 2:\r\nThey can complete their work within 24hrs.","contestCode":"SRM07","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM07%2Fw4ELFWv8I.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM07%2Fw4ELFWv8I.out?alt=media","createdAt":{"$date":"2019-01-25T10:20:45.922Z"},"updatedAt":{"$date":"2019-03-30T08:48:39.687Z"},"__v":0}
,{"_id":{"$oid":"5c4ae7c391b74800225c106f"},"tags":["dp"],"code":"SRM07C","points":400,"name":"Instructions please !","description":"Sashank and Neeraj have come to SIES GST for the first time for ByteCamp2019. They have made tiny devices that broadcast their locations(X,Y). While walking around campus they noticed that (N) devices have fell down from their bag. Sashank has a monitor that shows location of all the devices and both of them are facing north. Neeraj has to collect all the devices avoiding walls as soon as possible and return back to Sashank(Xp,Yp). Help Sashank to provide instructions to Neeraj via phone.\r\n\r\nInstructions are:\r\nMove forward to next place\r\nTurn towards left standing on same place\r\nTurn towards right standing on same place\r\nTurn backward standing on same place  \r\n<img src=\"https://i.imgur.com/OUrRAXj.png\" width=\"400px\">","explainInput":"The first line of input contain an integer <b>T</b> denoting the number of test cases. \r\nFirst line of each test case contains <b>N</b> denoting number of devices.\r\nNext line has space separated integers <b>Xp</b> and <b>Yp</b> .\r\nIt is followed by a line containing 2 space separated integers <b>Xmax</b> and <b>Ymax</b> denoting number of horizontal and vertical elements.\r\nNext Y line contain matrix of 1s and 0s. Where 0 is for walls and 1 is for path.\r\nNext N lines have space separated X and Y coordinate of the devices. ","explainOutput":"For each test case print minimum number of instructions to cover all device in same order as input.\r\nPrint “lost” without quotes if collecting all devices is not possible. ","constraints":"T < 101  \r\n0 < N < 6  \r\nX, Y < 21  ","example":"Input:\r\n2\r\n2\r\n5 2\r\n10 4\r\n0111111000\r\n1101011011\r\n1101110010\r\n0111111111\r\n3 0\r\n1 2\r\n1\r\n3 3\r\n4 4\r\n1011\r\n1011\r\n1011\r\n1011\r\n0 0\r\n\r\nOutput:\r\n18\r\nlost\t","explanation":"Test case1:  \r\n<img src=\"https://i.imgur.com/lNfeVst.png\" width=\"400\">  \r\n  \r\n  \r\nFFLFFFFLFFFLFFFFLF->18 instructions\r\n\r\nTest case2:\r\nNo possible path.","contestCode":"SRM07","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM07%2Fd8fNjVKuW.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM07%2Fd8fNjVKuW.out?alt=media","createdAt":{"$date":"2019-01-25T10:41:07.725Z"},"updatedAt":{"$date":"2019-03-30T08:48:50.401Z"},"__v":0}
,{"_id":{"$oid":"5c506d5c3027fa0022016678"},"tags":["adhoc"],"code":"SRM08A","points":100,"name":"Rarity Calculator ","description":"Barath and Mithil started playing Brawl Stars together, but Mithil is not able to get brawlers so he decided to write a program to find rarity of brawler  he get next in which he needs your help. He has to open brawl boxes to get brawlers. Each brawl box opened will give a value. When values from all the boxes are added, it tells the rarity of next brawler he gets. If the total number is more than 75 he will get a legendary brawler, if it is more than 50 and less than or equal to 75 he will get a mythical brawler. Again if total value is more than 25 and less than or equal to 50 he will get an epic brawler and if value is less than or equal to 25 he will not get a new brawler.","explainInput":"First line of the input consists of a number T denoting the number of test cases\r\nSecond line will have a number B denoting the number of boxes\r\nThird line will consist of B space-separated integers denoting the values obtained from each box a1, a2, a3, …, aB.","explainOutput":"Print-\r\nN if he gets no brawler.\r\nE if he gets an epic brawler\r\nM if a mythical brawler \r\nand \r\nL if he gets a legendary brawler.","constraints":"0< T <100\r\n0< B <1000\r\n0< a1, a2, a3….aB <75","example":"Input:\r\n4\r\n4\r\n1 4 6 2\r\n5\r\n10 5 6 5 5\r\n3\r\n25 25 5\r\n4\r\n40 40 10 15\r\n\r\n\r\nOutput:\r\nNEML","explanation":"Case 1 – the values he got were 1,4,6,2 which after adding became 13, which was less than 25 so he didn’t get a brawler.\r\nCase 2 – the values he got were 10, 5, 6, 5, 5, which on adding became 31 which was more than 25 so he got an epic brawler","contestCode":"SRM08","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM08%2FTtMGczRQm.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM08%2FTtMGczRQm.out?alt=media","createdAt":{"$date":"2019-01-29T15:12:28.271Z"},"updatedAt":{"$date":"2019-03-30T08:47:49.605Z"},"__v":0}
,{"_id":{"$oid":"5c506e743027fa0022016682"},"tags":["adhoc"," math"],"code":"SRM08B","points":200,"name":"Lecture Bunk","description":"Barath and Mithil have decided to bunk lectures but they always attend first lecture, and when there is only one lecture, basically they can’t bunk. There are ‘p’ no. of lectures happening in college  \r\nand ‘s’ is the time required between two consecutive lectures to bunk the class. Ti  is the time delay, with respect to decided schedule, by teacher to reach the class\r\nand ‘i’ is the lecture number. Now each teacher extends the lecture by time Ti, again with respect to schedule. Now next teacher, if arrived before the previous one left, will wait outside the class till this lecture gets done, and then enter as soon as the previous teacher leaves.","explainInput":"The first line of input contain an integer ‘T’ denoting the number of test cases. Each test case consists of two line. First line consists of two space separated integers, ‘p’ and ‘s’, where ‘p’ is number of lectures and ‘s’ is time required to bunk. Next line has ‘p’ space separated integers, ‘Ti’ indicating ith teacher’s time delay.","explainOutput":"For each test case, print a new line consisting of an integer, which is the lecture number just before which they are able to escape the lecture.If they cannot bunk, print -1.","constraints":"1<=t<=100\r\n1<=p<=20\r\n1<=q<=20\r\n1<=Ti<=20","example":"Input:\r\n1\r\n5 3\r\n1 3 7 8 5\r\nOutput:\r\n3","explanation":"For first lecture teacher came one minute late so he extended by 1 minute. Next teacher entered the class 3 minutes with respect to schedule, so we only got 2 minutes in between (3-1). Next we get 4 minutes and we are able to bunk just before 3rd lecture. Hence print 3.","contestCode":"SRM08","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM08%2FsYvW-8QQ1.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM08%2FsYvW-8QQ1.out?alt=media","createdAt":{"$date":"2019-01-29T15:17:08.673Z"},"updatedAt":{"$date":"2019-03-30T08:48:03.546Z"},"__v":0}
,{"_id":{"$oid":"5c5072073027fa002201668a"},"tags":["math"],"code":"SRM08C","points":250,"name":"Mischievous Barath","description":"Its exam time! Barath hates writing exams, and to postpone the exams, Barath has erased roll numbers from all desks! Mithil is happy too! No exams?!\r\nBut, this is SIES, so exams have to happen at any cost.\r\nPrincipal Sir has given Mithil the duty to quickly arrange for an immediate fix for this problem. Also, there are many classrooms, and number of benches in each row is uneven. Hence students find it difficult to find their seat. Can you help Mithil complete this task?\r\n(Only one student sits per bench. The seating fashion is first to last for first row and last to first for alternate rows)","explainInput":"The first line of input contains an integer T denoting the number of test cases. Each test case consists of three lines. First line takes N for number of rows. Next line takes N space separated integers A1, A2, A3…  AN for number of benches in each row. Lastly take input for roll number R.","explainOutput":"For each test case, output a single line with two space separated integers, indicating the row and bench number for given roll number.","constraints":"0 < T <= 100  \r\n0 < N <= 10  \r\n0 < Ai <= 20  \r\n0 < R <= ΣAi  ","example":"Input:\r\n2\r\n3\r\n4 4 4\r\n7\r\n5\r\n1 2 3 4 5\r\n9\r\nOutput:\r\n2 2\r\n4 2","explanation":"1)<img src = \"https://i.imgur.com/eTfYKdh.jpg\">\r\n2)<img src = \"https://i.imgur.com/VDG7pyL.jpg\">","contestCode":"SRM08","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM08%2FmmAxDoMSM.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM08%2FmmAxDoMSM.out?alt=media","createdAt":{"$date":"2019-01-29T15:32:23.3Z"},"updatedAt":{"$date":"2019-03-30T08:48:14.387Z"},"__v":0}
,{"_id":{"$oid":"5c7abbd75dfcc900221e1119"},"tags":["adhoc"],"code":"SRM09A","points":100,"name":"Grenade Matrix","description":"A team of players is stuck in a building, and grenades are being thrown into the building. Hence, a matrix of size MxN is formed, with players, grenades and empty spots where the grenades are denoted by “G”, the players are denoted by “P”, and empty spots denoted by “*”. The player will die if there is a grenade in any of the 8 blocks surrounding the player. Count the number of players that survive the grenade attacks.","explainInput":"The first line contains X number of test cases.\r\nThe second line contains M and N, number of columns and rows respectively.\r\nThe next N lines contains M non-spaced characters to form the matrix.","explainOutput":"X lines contains number of players that survive.","constraints":"1 <= X <= 1000\r\n1 <= M < N <= 1000","example":"Input: \r\n1\r\n10 11\r\n<img src = \"https://i.imgur.com/IAGTqnt_d.jpg\">\r\n\r\n\r\nOutput:\r\n4","explanation":"There are a total of 8 players, out of which 4 have grenades in adjacent blocks. Hence 4 players survive the blast.","contestCode":"SRM09","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM09%2FPuruJsoo.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM09%2FPuruJsoo.out?alt=media","createdAt":{"$date":"2019-03-02T17:22:31.899Z"},"updatedAt":{"$date":"2019-12-24T03:59:35.884Z"},"__v":0}
,{"_id":{"$oid":"5c7ac7bf5dfcc900221e112b"},"tags":["adhoc"," math"],"code":"SRM09B","points":200,"name":"Zombie Mode","description":"There’s a new Special Game Mode in PUBG called the Zombie Mode.\r\nIn order to win the game, you’ll have to kill all the zombies or survive till the time is over.\r\nThere are two types of Zombies : Giant Zombies and Small Zombies.\r\nGiant Zombies moves at a speed of 1 block per second & takes 8 bullets to be killed.\r\nSmall Zombies moves at a speed of 2 blocks per second & takes 4 bullets to be killed.\r\nYou have N bullets at the start and you have to survive for M seconds to win the game. You can fire 4 bullets per second.\r\nThere are G no. of Giant Zombies and S no. of Small Zombies which are moving towards you at their respective speeds. Distances of all the Zombies from you is given. If they touch you then GAME OVER.","explainInput":"The first line of the input consists of a single integer T denoting the number of test cases.\r\nEach test case contains 4 lines which are as follows :\r\nThe first line consists of two integers N and M respectively.\r\nThe second line contains of two integers G and S respectively.\r\nThe third line consists of G space-separated integers denoting distance of each Giant Zombie from you.\r\nThe fourth line consists of S space-separated integers denoting distance of each Small Zombie from you.","explainOutput":"For each test case print a single line containing “WINNER WINNER CHICKEN DINNER” without the quotes if you win else print “GAME OVER” without the quotes.","constraints":"1 <= T <= 100\r\n1 <= N <= 10^6\r\n1 <= M,G,S <= 10^4\r\n1 <= G[i],S[i] <= 10^5","example":"Input:\r\n3\r\n50 10\r\n3 4\r\n8 10 9\r\n2 15 12 9\r\n35 10\r\n3 4\r\n5 7 9\r\n4 16 2 20\r\n50 10\r\n3 4\r\n6 2 10\r\n10 20 5 16\r\n\r\nOutput:\r\nWINNER WINNER CHICKEN DINNER\r\nGAME OVER\r\nGAME OVER","explanation":"In Test Case 1: There are enough bullets to kill all the zombies and all the zombies can be killed before any zombie touches you.\r\nIn Test Case 2: There are not enough bullets to kill all the zombies.\r\nIn Test Case 3: There are enough bullets. But as you’ll first kill the Giant Zombie at distance 2 the Small Zombie with distance 5 will come at distance of 1 block and there’ll not be enough time for you to kill him before he touches you. If you try to kill the Small Zombie at distance 5 first, the Giant Zombie at distance 2 will kill you.","contestCode":"SRM09","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM09%2Fo6dvVJAfy.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM09%2Fo6dvVJAfy.out?alt=media","createdAt":{"$date":"2019-03-02T18:13:19.809Z"},"updatedAt":{"$date":"2019-03-30T08:47:05.844Z"},"__v":0}
,{"_id":{"$oid":"5c7ac9bc5dfcc900221e112d"},"tags":["dp"],"code":"SRM09C","points":300,"name":"Aditya Loves PUBG","description":"“The early bird gets the first worm, but the wisest bird gets the fastest one.”\r\n\r\nAditya is really fond of playing PUBG. He is constantly finding ways to improve his game so that he can beat his friends Rohan and Raghav. Rohan and Raghav have been playing  PUBG since a year. So, both of them know how to win through practice. Aditya, on the other hand is a newbie. But, Aditya is smart. So, he is finding smart ways to win. \r\n\r\nThe game has started. Aditya has to collect guns from various scattered places. \r\nYou are being given the directions to collect the guns. Aditya has limited space in his bag. He has to follow the directions till the end and return back to the beginning to collect the guns. He has to choose the appropriate gun in order to maximise his killing efficiency.\r\n\r\nA set of directions consists of several instructions. The first instruction is of the form \"Start on XYZ\", indicating the street that the route begins on. The next instruction is of the form “Left on abc” indicating the next road after collecting the gun.\r\n\r\nCan you help Aditya figure out the best guns he can collect?","explainInput":"The first line of the input consists of a single integer T denoting the number of test cases.\r\nThe second line consists of an integer M which denotes the maximum weight of gun he can carry , an integer Z which denotes the total number of roads he has been to and integer N which denotes the total number of guns.\r\nThe third line contains N inputs of weights of the gun wt[i] and the fourth line contains corresponding power of those guns p[i]. \r\nThe following Z lines give instructions showing his route:-\r\nFirst line consists of the first road. The second line consists of the second road (along with change in direction).\r\nSimilar lines follow.","explainOutput":"Print Z lines containing his way back to the beginning road with the last traversed road as the first road and vice versa.\r\nAnd the last line = Sum of the power of guns he can carry in horsepower. ","constraints":"1 <= T <= 10^2\r\n1 <= M <= 10^2\r\n1 <= Z <= 10^3\r\n1 <= N <= 10^4\r\n1 <= wt[i] <= 10^2\r\n1 <= p[i] <= 10^3\r\n1 <= Length[roadname] <= 10^3","example":"Input:\r\n1\r\n50 4 3\r\n10 20 30\r\n60 100 120\r\nStart on xyz\r\nLeft on abc\r\nRight on efg\r\nLeft on hgf\r\n\r\nOutput:\r\nStart on hgf\r\nRight on efg\r\nLeft on abc\r\nRight on xyz\r\n220","explanation":"The directions given are to be traced back in the opposite direction and printed.\r\nThe maximum weight he can carry is 50. So, the best way possible is to carry the guns with weights 20 and 30. So, total power is 100+120 = 220. \r\n\r\n<img src = \"https://i.imgur.com/5aY5aOx.jpg\">","contestCode":"SRM09","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM09%2Ftg92Ckl0S.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM09%2Ftg92Ckl0S.out?alt=media","createdAt":{"$date":"2019-03-02T18:21:48.945Z"},"updatedAt":{"$date":"2019-03-30T08:46:56.237Z"},"__v":0}
,{"_id":{"$oid":"5c98eb0d16c4b60022cd52f0"},"tags":["dp"," strings"],"code":"GBYE19E","points":100,"name":"Drake Loves Kiki","description":"<b>Problem Author: Sanket Bailmare</b>\r\nDrake loves to compose songs. This time he decides to compose in the language and grammar of his own. He decides to construct the words dictionary which would help him to compose his song. This time when he decides to something different, he tries to impress Kiki with the lines having some pattern. He shows <b>T </b>cases having <b>N</b> words each to Kiki to impress her. She gets impressed when she sees that each word is starting with a letter same as the ending letter of preceding word. \r\nYou have to tell whether Kiki is <b>Impressed</b> with Drake or not.","explainInput":"The first line of input contain an integer <b>T</b> denoting the number of test cases.\r\nEach test case consists number of words <b>N</b> followed by space separated N words(small case) on the next line.","explainOutput":"For each test case, output a single line <b>“impressed”</b> if the condition is satisfied.\r\nAnd <b>“disappointed”</b> if condition is not satisfied.","constraints":"1<=T<= 1000\r\n2<=N<=50","example":"<b>Input:</b>\r\n3\r\n4\r\nabcd defg qhij oklm\r\n3\r\nmcqz zqed defg\r\n3\r\nabcd klmn dejk\r\n<b>Output:</b>\r\ndisappointed\r\nimpressed\r\nimpressed","explanation":"In test case 1 words <b>“abcd”</b>  &  <b>“defg”</b> satisfy the criteria but the remaining words do not satisfy hence kiki is disappointed with these words.\r\nIn test case 2 words are <b>arranged</b> in the order where the condition is satisfied hence kiki is <b>impressed</b>.\r\nIn test case 3 words can be <b>arranged</b> in order to meet the condition hence kiki is <b>impressed</b>.","contestCode":"GBYE19","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FGBYE19%2FQGuxRXNji.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FGBYE19%2FQGuxRXNji.out?alt=media","createdAt":{"$date":"2019-03-25T14:51:57.823Z"},"updatedAt":{"$date":"2019-03-30T08:46:01.506Z"},"__v":0}
,{"_id":{"$oid":"5c98edc316c4b60022cd52f1"},"tags":["adhoc"," strings"],"code":"GBYE19G","points":100,"name":"The Chat Pattern","description":"<b>Problem Author: Vipul Raghuvanshi</b>\r\nIts the final year of engineering, Vipul and Yash are best friends since FE. They have a peculiar texting pattern when they chat during some exciting talks. The pattern is all the words should start with uppercase character and also ends with uppercase character following the rule of alternate uppercase and lowercase characters. In case of even word length, the two characters at the centre can have same case (uppercase / lowercase). Yash is thinking of some algorithm to convert all his text messages in the required pattern. Help Yash to write a program for this problem.","explainInput":"The first line of input contain an integer T denoting the number of test cases. Each test case consists of one line, which contains a string S which denotes a text of N words with L characters each.","explainOutput":"For each test case, output a single line which contains the text following pattern.","constraints":"T <= 100\r\n3 <= N <= 100\r\n3 <= L <= 60 ","example":"<b>Input:</b>\r\n2\r\nBohot Hard\r\nBohot Zyaada Hard\r\n\r\n<b>Output:</b>\r\nBoHoT HarD\r\nBoHoT ZyAAdA HarD","explanation":"Both the output strings are following the required pattern.","contestCode":"GBYE19","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FGBYE19%2F5RR7WNZKT.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FGBYE19%2F5RR7WNZKT.out?alt=media","createdAt":{"$date":"2019-03-25T15:03:31.266Z"},"updatedAt":{"$date":"2019-03-30T08:46:14.477Z"},"__v":0}
,{"_id":{"$oid":"5c98f64b16c4b60022cd52f3"},"tags":["adhoc"," math"],"code":"GBYE19F","points":100,"name":"TML Events","description":"<b>Problem Author: Shridhar Ravi</b>\r\nTML is around the corner and GSTians are excited about it. Omkar has been chosen as the Fest Coordinator this year. He has introduced a new system of participating in the events this TML. \r\nThere are <b>N</b> different events with some entry fees. With this new system of his, students can buy an <i>Entry card</i> worth Rs. <b>K</b>. But, this card is non-rechargeable and can be used exactly for 2 events, such that the entry fees of both the events are not greater than Rs. <b>K</b>. \r\nOmkar has listed all the events and their entry fees and has <b>Q</b> queries. He has specified a range of events, from <b>L</b> to <b>R</b> (both <b>L</b> and <b>R</b> inclusive). He needs your help to know how many different combinations of events a student can participate in the specified range for a card worth Rs. <b>K</b>. ","explainInput":"The first line of the input contains two space-separated integers <b>N</b> and <b>Q</b>, denoting the number of events and the number of queries respectively.\r\nThe next line contains <b>N</b> space-separated integers denoting the entry fees of each event.\r\nThe next <b>Q</b> lines contain 3 space-separated integers <b>L</b>, <b>R</b>, and <b>K</b> denoting the range and worth of the entry card respectively.","explainOutput":"For each query <b>Q</b>, output the integer denoting the different combinations of events possible.","constraints":"1 ≤ N ≤ 10^3\r\n1 ≤ Q ≤ 10^3\r\n1 ≤ L ≤ R ≤ N \r\n1 ≤ Entry fee ≤ 10^3\r\n1 ≤ K ≤ 2*(10^3)","example":"<b>Input</b>:\r\n7 3\r\n5 1 2 3 2 3 1\r\n1 4 3\r\n1 5 4\r\n2 7 3\r\n<b>Output</b>:\r\n1\r\n4\r\n5","explanation":"For the 1st query, there is only one combination possible in the given range:\r\n2nd event (Fee: 1) + 3rd Event (Fee: 2)=3\r\n\r\nFor the 2nd query, there are 4 combinations possible in the given range:\r\n2nd event (Fee: 1) + 3rd Event (Fee: 2)=3 (which is less than card’s worth K=4)\r\n2nd event (Fee: 1) + 4th Event (Fee: 3)=4\r\n2nd event (Fee: 1) + 5th Event (Fee: 2)=3 (which is less than card’s worth K=4)\r\n3rd event (Fee: 2) + 5th Event (Fee: 2)=4","contestCode":"GBYE19","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FGBYE19%2FBJmyzdlLp.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FGBYE19%2FBJmyzdlLp.out?alt=media","createdAt":{"$date":"2019-03-25T15:39:55.525Z"},"updatedAt":{"$date":"2019-03-30T10:04:37.509Z"},"__v":0}
,{"_id":{"$oid":"5c9b945e6769cb002257bcb5"},"tags":["graphs"],"code":"GBYE19D","points":100,"name":"TE'S And Their Project Groups","description":"<b>Problem Author: Pritam Negi</b>\r\nThird year Engineering students are just about to finish their term of Semester 6. As they are nearing their entry into the final year of Engineering now they have been informed to form their project groups by the end of Semester 6. \r\nNow the students want to include only those students in their project groups whom they have synergy with. Also the condition according to the university norms is that every project group must contain at least 2 members but not more than 4 members. So a project group is considered as valid if it satisfies the above condition. \r\nThe existence of synergy is mutual i.e. if student <b>i</b> has synergy with student <b>j</b> then student <b>j</b> has synergy with student <b>i</b> as well. Also the existence of synergy is transitive. This means that if student <b>i</b> is has synergy with student <b>j</b> AND student <b>j</b> has synergy with student <b>k</b>, then student <b>i</b> and student <b>k</b> will have synergy among each other.\r\nThis complicates the task for the Project Coordinator to determine the number of valid project groups that exist in the whole class. Hence she needs your help. Given the number of students and synergy list help project coordinator determine the number of valid project groups.","explainInput":"The first line of the input contains a single integer <b>T</b>, denoting the number of test cases. The description of T test cases follows. The first line of each test case contains two space-separated integers <b>N</b> and <b>M</b>, denoting the number of students and the number of synergy relations, respectively. Each of the following M lines contains two space-separated integers i and j, denoting student i and student j have synergy among themselves.","explainOutput":"For each test case, output a single line containing two space separated integers, denoting the maximum number of valid project groups that can be formed.","constraints":"1<= T <= 5\r\n1<= N <= 10<sup>5</sup>\r\n1<= M <= 10<sup>5</sup>\r\n1 <= i,j <= N\r\ni ≠ j\r\nFor any pair of student i and j such that 1 ≤ i < j ≤ N, at most one pair among (i, j) and (j, i) will appear in the input.","example":"<b>Input:</b>\r\n2\r\n4 2\r\n1 2 \r\n2 3\r\n6 3\r\n1 2 \r\n3 4\r\n5 6\r\n\r\n<b>Output:</b>\r\n1\r\n3","explanation":"<b>TEST CASE 1:</b> In this case student 1 has synergy with student 2. Student 2 in turn has synergy with student 3. Hence student 1,2,3 can form a project group of 3 members. Student 4 has synergy with no other student hence cannot be considered as a valid  project group. Hence only 1 valid project group exists in this case.\r\n\r\n<b>TEST CASE 2:</b> In this case student 1 has synergy with student 2 so they can form a form a group of 2 members. Same goes for group of students 3, 4 and 5, 6. Hence 3 valid project groups exist in this case.","contestCode":"GBYE19","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FGBYE19%2FZ905BLPI3.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FGBYE19%2FZ905BLPI3.out?alt=media","createdAt":{"$date":"2019-03-27T15:18:54.75Z"},"updatedAt":{"$date":"2019-03-30T08:44:57.61Z"},"__v":0}
,{"_id":{"$oid":"5c9f2ade66d9c7002236765e"},"tags":["adhoc"," math"],"code":"GBYE19A","points":100,"name":"Swedish House Mafia ⚫️⚫️⚫️","description":"<b>Problem Author: Omkar Prabhu</b>\r\nLets celebrate <b>03 25 18</b>!\r\nYou are given a very long number, find if it is divisible by 03 or not.","explainInput":"The first line contains T the number of test cases.\r\nEach test case contains a number N.\r\n","explainOutput":"For each test case, print single line containing <b>greyhound</b> or <b>untilone</b> if number is divisible by 03 or not respectively.\r\n","constraints":"1 &lt; T &lt; 100\r\n1 &lt; N &lt; 10^100 (oh yeah)","example":"<b>Input:</b>\r\n2\r\n22\r\n100002\r\n\r\n<b>Output:</b>\r\nuntilone\r\ngreyhound","explanation":"Listen to them here:\r\nAxwell: <a href=\"https://www.youtube.com/watch?v=R4shwJBnYEM\">In My Mind</a>\r\nSebastian Ingrosso: <a href=\"https://www.youtube.com/watch?v=I04oPxN3208\">Reload</a>\r\nSteve Angello: <a href=\"https://www.youtube.com/watch?v=P6GmT-WJR_k\">Payback</a>","contestCode":"GBYE19","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FGBYE19%2F9Xye0bou8.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FGBYE19%2F9Xye0bou8.out?alt=media","createdAt":{"$date":"2019-03-30T08:37:50.768Z"},"updatedAt":{"$date":"2019-03-30T10:14:13.9Z"},"__v":0}
,{"_id":{"$oid":"5c9f3d52a9c6000022af0e05"},"tags":["math"," string"," adhoc"],"code":"GBYE19B","points":100,"name":"Consistent brand","description":"<b>Problem Author: Kaustubh Badrike</b>\r\nAs always, Raju the marketing coordinator is looking for sponsors to the upcoming fest. This time, he’s set his sights on notebook brands. To compare brands, he’s collected <b>N</b> notebooks from all over the campus. However, he doesn’t want just any brand, he’s looking for a brand with the longest consistent streak.\r\nA brand is said to have a consistent streak if the number of pages of the brand’s <b>i</b><sup>th</sup> occurrence is the same as the number of pages of the brand’s <b>(i+1)</b><sup>th</sup> occurrence. If two brands have the same length of the longest consistent streak, the brand with more number of pages in it’s longest consistent streak is preferred. If the number of pages in the longest consistent streak is also the same for two brands, the brand appearing earlier in the dictionary is preferred.","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases. Each test case consists of three lines.\r\nThe first line of each test case consists of a single integer, <b>N</b>.\r\nThe second line consists of <b>N</b> space-separated strings, where the <b>n</b><sup>th</sup> string denotes the brand of the <b>n</b><sup>th</sup> notebook.\r\nThe third line consists of <b>N</b> space-separated integers, where the <b>n</b><sup>th</sup> integer denotes the number of pages of the <b>n</b><sup>th</sup> notebook.","explainOutput":"For each test case, output a single line with the brand having the longest consistent streak.","constraints":"1 <= <b>T</b>, <b>N</b>, <b>pages of notebook</b> <= 100\r\n1<= <b>|brand name|</b> <=10","example":"<b>Input</b>:\r\n1\r\n9\r\nA\tC\tB\tC\tB\tA\tB\tC\tA\r\n2\t6\t7\t4\t5\t4\t5\t6\t8\r\n\r\n<b>Output</b>:\r\nB","explanation":"The 2<sup>nd</sup> and 3<sup>rd</sup> occurrences of B have the same number of pages (5). Hence the brand B has the longest consistent streak (length 2).","contestCode":"GBYE19","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FGBYE19%2Fgp8ADCpql.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FGBYE19%2Fgp8ADCpql.out?alt=media","createdAt":{"$date":"2019-03-30T09:56:34.424Z"},"updatedAt":{"$date":"2019-03-30T13:32:08.282Z"},"__v":0}
,{"_id":{"$oid":"5ca063dd08f90d00223749ea"},"tags":["math"," dp"],"code":"GBYE19C","points":100,"name":"Don't You Worry Child (Surprise Problem)","description":"<b>Problem Author: Omkar Prabhu</b>\r\nWhen we thought of this contest at first, we all were like, “wow, we would tell our college stories!\" and soon we all realised that time really flied in these 4 years...\r\n\r\nWhat did we care about the most in these 4 years? Marks? Attendance? Assignments? Huh, NO!\r\nWe made sure we are learning in all aspects and get inspired every single day to come up with new ideas and new projects or something new to keep us happy.\r\n\r\nWant to feel that vibe to come to college for your remaining years? Find that \"one thing\" which you feel interesting. No matter what it is, it can be music, academics, tech, drama, dance, logistics, marketing, just get into that damn thing and explore!\r\n\r\nBut, we all experienced one common thing, \"ye semester chod, agle semester pakka 7+ or 8+ or 9+ launga!\". So here you are.\r\nYou will be given marks of <b>N</b> subjects and you are given <b>S</b> semesters. Let's define an array A with size <b>N x S</b> as the array that's formed by concatenating S copies of N.\r\n\r\nFor example, if N = {6, 9} and S = 3, then A = {6, 9, 6, 9, 6, 9}.\r\n\r\nYou have to find the maximum subarray sum of the new array. Fomally, you should compute the maximum value of A<sub>i</sub> + A<sub>i+1</sub> + A<sub>i+2</sub> + ... + A<sub>j</sub>, where 0 &le; i &le; j &le; (N x S).\r\n","explainInput":"The first line of the input contains a single integer T denoting the number of test cases.\r\nThe first line of each test case contains two space-separated integers N and S.\r\nThe second line contains N space-separated integers.","explainOutput":"For each test case, print a single line containing the maximum subarray sum of the new array A.","constraints":"1 &le; T &le; 25\r\n1 &le; N, S &le; 10<sup>4</sup>\r\n-10<sup>2</sup> &le; N<sub>i</sub> &le; 10<sup>2</sup>","example":"<b>Input:</b>\r\n2\r\n2 3\r\n1 2\r\n3 2\r\n1 -2 1\r\n\r\n<b>Output:</b>\r\n9\r\n2","explanation":"Case 1: A = {1, 2, 1, 2, 1, 2} and the subarray with maximum sum is the whole {1, 2, 1, 2, 1, 2}. So the answer is 9.\r\nCase 2: A = {1, -2, 1, 1, -2, 1} and the subarray with maximum sum is {1, 1}. So the answer is 2.","contestCode":"GBYE19","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FGBYE19%2F83GoWzB87.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FGBYE19%2F83GoWzB87.out?alt=media","createdAt":{"$date":"2019-03-31T06:53:17.015Z"},"updatedAt":{"$date":"2019-03-31T06:55:39.107Z"},"__v":0}
,{"_id":{"$oid":"5d3c780e7cb1120022007f29"},"tags":["math"],"code":"BETA01A","points":100,"name":"Miu hates rectangles","description":"Miu - The smart cat is back\r\nToday she came across a set of cardboard boxes arranged on the floor\r\n\r\nThe boxes are arranged in <b>R</b> rows and <b>C</b> columns ( <b>R</b> is not equal to <b>C</b> )\r\nMiu doesn’t like this arrangement since they form a rectangle\r\n\r\nShe wants to know if it is possible to rearrange them in a form of a square of side length <b>greater than</b> or <b>equal to N</b>\r\n( It is allowed to discard some of the boxes )\r\n\r\nSince Miu is short of sleep and low on coffee, she is not able to think properly\r\nHelp her to find out if this is possible or not\r\n","explainInput":"The first line of the input consists of a single integer <b>T</b>, denoting the number of test cases (i.e queries)\r\nThe only line of each test case consists 3 space-separated integers <b>R</b>, <b>C</b> and <b>N</b>","explainOutput":"For each test case, output the answer in a <b>single line</b>:\r\n<b>1</b> -> if it is possible\r\n<b>0</b> -> if it is not possible","constraints":"<ul>\r\n<li>1 <= <b>T</b> <= 100</li>\r\n<li>1 <= <b>R</b>, <b>C</b>, <b>N</b> <= 100000</li>\r\n<li><b>R</b> is not equal to <b>C</b></li>\r\n</ul>","example":"<b>Input:</b>\r\n5\r\n4 2 3\r\n5 3 2\r\n2 8 4\r\n1 2 2\r\n2 5 1\r\n\r\n<b>Output:</b>\r\n0\r\n1\r\n1\r\n0\r\n1\r\n","explanation":"<b>Test Case 1:</b> the number of boxes available aren’t enough for making a 3 by 3 arrangement\r\n<b>Test Case 2:</b> the number of boxes available are enough for making a 2 by 2 arrangement\r\n","contestCode":"BETA01","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FBETA01%2FmS-II9KKF.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FBETA01%2FmS-II9KKF.out?alt=media","createdAt":{"$date":"2019-07-27T16:13:02.725Z"},"updatedAt":{"$date":"2019-07-28T04:48:51.555Z"},"__v":0}
,{"_id":{"$oid":"5d3c81e87cb1120022007f2f"},"tags":["strings"],"code":"BETA01D","points":200,"name":"Swapnil and his autocorrect","description":"Swapnil has got a new phone!\r\nBut guess what, its keyboard’s autocorrect system is annoying.\r\n\r\nWhenever the autocorrect changes Swapnil’s word into a wrong word, he retypes a new word with an asterisk (*) at the beginning.\r\n\r\nYou will be given <b>N</b> words sent by Swapnil.\r\nPrint the exact message Swapnil wants to convey in the format given below.\r\n","explainInput":"The first line of the input consists of a single integer <b>T</b>, denoting the number of Test Cases.\r\nThe first line of each test case consists of a single integer <b>N</b>.\r\nThe next <b>N</b> lines consists of the <b>N</b> words sent by Swapnil ","explainOutput":"For each test case, print the exact message Swapnil wanted to convey with each word on a new line.\r\n(See example for clarification)","constraints":"<ul>\r\n<li>1 <= <b>T</b> <= 10</li>\r\n<li>1 <= <b>N</b> <= 1000</li>\r\n<li>All strings are only formed with lower case alphabets and asterisk (*)</li>\r\n<li>The length of any string doesn’t exceed 20</li>\r\n<li>No two consecutive words in the input begin with an asterisk (*) <br> ( i.e. swapnil corrects any wrong word in one shot )\r\n</li>\r\n<li>The first word of any test case doesn’t begin with an asterisk</li>\r\n</ul>","example":"<b>Input:</b>\r\n3\r\n8\r\nhellow\r\n*hello\r\nmy\r\ngame\r\n*name\r\nis\r\nswap\r\n*swapnil\r\n5\r\ni\r\nam\r\nlearning\r\nbackpain\r\n*blockchain\r\n4\r\nhey\r\nhow\r\nyou\r\ndoin\r\n\r\n<b>Output:</b>\r\nhello\r\nmy\r\nname\r\nis\r\nswapnil\r\ni\r\nam\r\nlearning\r\nblockchain\r\nhey\r\nhow\r\nyou\r\ndoin\r\n","explanation":"The incorrect words were removed.\r\nNote that the asterisk is removed from the corrected words.\r\nThe 3rd test case consists of no wrong words, so we print them as they are.\r\n","contestCode":"BETA01","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FBETA01%2Ffj35meqSJ.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FBETA01%2Ffj35meqSJ.out?alt=media","createdAt":{"$date":"2019-07-27T16:55:04.413Z"},"updatedAt":{"$date":"2019-07-28T04:59:10.236Z"},"__v":0}
,{"_id":{"$oid":"5d3c84697cb1120022007f30"},"tags":["heap,sorting"],"code":"BETA01E","points":300,"name":"XOR Modification","description":"You are given two arrays <b>A</b> & <b>B</b> of length <b>N</b>, \r\nA1 A2… AN &\r\nB1 B2… BN \r\n\r\nYou are supposed to do the following operation <b>N</b> times:\r\nFor the <b>(i)th</b> number of operation:\r\n<ul>\r\n<li>Pick up the current largest element from the array <b>A</b>, let’s call it <b>X</b></li>\r\n<li>Delete <b>X</b> from the array <b>A</b></li>\r\n<li>Insert (<b>X ^ Bi</b>) anywhere in the array <b>A</b> <br> ( where ^ denotes the bitwise XOR operation )</li>\r\n</ul>\r\n\r\nFinally print the final array <b>A</b> in ascending order","explainInput":"The first line of the input consists of a single integer <b>T</b>, denoting the number of test cases.\r\nThe first line of each test case consists of a single integer <b>N</b>\r\nThe next line consists of <b>N</b> space-separated integers A1 A2… AN\r\nThe next line consists of <b>N</b> space-separated integers B1 B2… BN","explainOutput":"For each test case, print a single line consisting of <b>N</b> space-separated integers, denoting the final array <b>A</b> sorted in ascending order.","constraints":"<ul>\r\n<li>1 <= <b>T</b> <= 10</li>\r\n<li>1 <= <b>N</b> <= 10^5</li>\r\n<li>1 <= <b>Ai, Bi</b> <= 10^9</li>\r\n</ul>","example":"<b>Input:</b>\r\n2\r\n6\r\n2 3 5 2 6 5\r\n9 3 6 3 1 3\r\n4\r\n1 2 3 1\r\n2 4 5 5\r\n\r\n\r\n<b>Output:</b>\r\n2 2 3 5 5 11\r\n1 1 1 6\r\n","explanation":"<b>Test Case 2:</b>\r\n\r\n3 ^ 2 -> 1\r\nNew array -> [ 1, 2, 1, 1 ]\r\n\r\n2 ^ 4 -> 6\r\nNew array -> [ 1, 6, 1, 1 ]\r\n\r\n6 ^ 5 -> 3\r\nNew array -> [ 1, 3, 1, 1 ]\r\n\r\n3 ^ 5 -> 6\r\nNew array -> [ 1, 6, 1, 1 ]\r\n\r\nSorted array -> [ 1, 1, 1, 6 ]\r\n","contestCode":"BETA01","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FBETA01%2FKtuzw8GQK.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FBETA01%2FKtuzw8GQK.out?alt=media","createdAt":{"$date":"2019-07-27T17:05:45.704Z"},"updatedAt":{"$date":"2019-07-28T05:01:24.408Z"},"__v":0}
,{"_id":{"$oid":"5d3c94af7cb1120022007f38"},"tags":["adhoc"],"code":"BETA01B","points":100,"name":"Book Cricket","description":"Piyush and Gokul were arguing during the lectures over who is the better cricket player out of the two. They decided to settle it through a book cricket match. Now, you have to determine who is the winner of the match.\r\n\r\nBoth Piyush and Gokul have <b>N</b> no. of turns.\r\n\r\nThey can score runs -  0,2,4,6,8 where <b>0</b> means <b>OUT</b>.\r\n\r\nThe final score is the sum of runs.\r\nThe player with <b>maximum</b> score wins. In case of a tie the player losing <b>less</b> wickets wins.\r\nIf both players have the same final score and both have lost same no. of wickets then it’s a <b>draw</b>.","explainInput":"The first line of the input consists of a single integer <b>T</b> denoting the number of test cases.\r\nEach test case contains 3 lines which are as follows:\r\nThe first line consists of a single integer <b>N</b> denoting no. of turns.\r\nThe second line consists of <b>N</b> space separated integers denoting runs scored by Piyush.\r\nThe third line consists of <b>N</b> space separated integers denoting runs scored by Gokul.","explainOutput":"For each test case, print a single line containing the name of the winner - <b>'Piyush’</b> or <b>‘Gokul’</b> without the quotes. In case of a draw print <b>‘Draw’</b> without the quotes.\r\n<b>NOTE:</b> The output is case sensitive. Please print the the exact words as mentioned above.","constraints":"1 <= <b>T</b> <= 100\r\n1 <= <b>N</b> <= 10^5\r\n<b>Run[i]</b> can have value 0,2,4,6,8.","example":"<b>Input:</b>\r\n3\r\n6\r\n4 6 8 2 0 4\r\n2 8 0 6 2 2\r\n5\r\n2 8 6 0 4\r\n8 6 2 2 2\r\n5\r\n8 6 4 0 2\r\n2 0 4 6 8\r\n\r\n<b>Output:</b>\r\nPiyush\r\nGokul\r\nDraw","explanation":"<b>Test Case 1:</b> The final score of Piyush is 24 runs with 1 wicket gone & final score of Gokul is 20 runs with 1 wicket gone. Since, final score of Piyush is more than Gokul, Piyush is the winner.\r\n\r\n<b>Test Case 2:</b> Both Piyush and Gokul have same final score of 20 runs but Piyush lost 1 wicket while Gokul lost 0. Since, Gokul lost less wickets than Piyush, Gokul won the match.\r\n\r\n<b>Test Case 3:</b> Both Piyush and Gokul have the same final score of 20 and both lost 1 wicket each. Since, their final scores and wickets lost are the same, it’s a Draw.","contestCode":"BETA01","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FBETA01%2F1yJavSbuR.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FBETA01%2F1yJavSbuR.out?alt=media","createdAt":{"$date":"2019-07-27T18:15:11.203Z"},"updatedAt":{"$date":"2019-07-28T08:44:45.167Z"},"__v":0}
,{"_id":{"$oid":"5d3c981a7cb1120022007f39"},"tags":["strings"],"code":"BETA01C","points":100,"name":"Keyboard Prank","description":"Ashok’s laptop was hacked by Ninad as he decided to play a prank on him. He changed the settings of Ashok’s keyboard and replaced the output of letters ‘a’, ‘s’, ‘h’, ‘o’, ‘k’ with ‘n’, ‘i’, ‘n’, ‘a’, ‘d’ respectively.\r\nThat is\r\n<b>‘a’</b> gets replaced with <b>‘n’</b>\r\n<b>‘s’</b> gets replaced with <b>‘i’</b>\r\n<b>‘h’</b> gets replaced with <b>‘n’</b>\r\n<b>‘o’</b> gets replaced with <b>‘a’</b>\r\n<b>‘k’</b> gets replaced with <b>‘d’</b>\r\nNow, whenever Ashok will send someone a message the letters will get replaced.\r\nYou have to determine what message will be received.\r\n<b>NOTE :</b> The message string does not contain any spaces.","explainInput":"The first line of the input consists of a single integer <b>T</b> denoting the number of test cases.\r\nEach test case consists of a single line containing a string <b>S</b> that Ashok wants to send to his friend.","explainOutput":"For each test case, print a single line which consists of the string which the receiver will receive.","constraints":"1< = T <= 1000\r\n1 <= Length(<b>S</b>) <= 10^4\r\nAll the strings will have only lowercase alphabets.","example":"<b>Input:</b>\r\n3\r\nash\r\nashok\r\ncoffee\r\n\r\n<b>Output:</b>\r\nnin\r\nninad\r\ncaffee","explanation":"<b>Test Case 1:</b> Here, ‘a’, ‘s’, ‘h’ gets replaced with ‘n’, ‘i’, ‘n’ respectively.\r\n<b>Test Case 2:</b> Here, ‘a’, ‘s’, ‘h’, ‘o’, ‘k’ gets replaced with ‘n’, ‘i’, ‘n’, ‘a’, ‘d’ respectively.\r\n<b>Test Case 3:</b> Here, ‘o’ in ‘coffee’ gets replaced with ‘a’ to give ‘caffee’.","contestCode":"BETA01","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FBETA01%2F686_rIiIb.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FBETA01%2F686_rIiIb.out?alt=media","createdAt":{"$date":"2019-07-27T18:29:46.867Z"},"updatedAt":{"$date":"2019-07-28T08:42:28.887Z"},"__v":0}
,{"_id":{"$oid":"5d46f3ce86031f00223f4ce7"},"tags":["cakewalk","math"],"code":"SRM10A","points":100,"name":"Shiny Calculation","description":"Red catches <b>N </b>pokemons.\r\nWhenever he catches a pokemon he documents it .\r\nIf its a not shiny he writes <b>1</b> and if shiny he writes <b>*</b>.\r\nWrite a code to find the percentage of shiny encounter for Red.\r\n<b>Note</b>: Only print the integer value of the percentage.","explainInput":"The first line consists of a single integer  <b>T</b>,  the number of test cases\r\nThe second line consists of a single integer <b>N</b>, the number of Pokemon caught by Red\r\nThe third line consists of <b>N</b> characters:  1/* depending upon the catch of Red.","explainOutput":"Output\r\nFor each test case, print a single <b>line</b> consisting the shiny percentage followed by “%”\r\n<b>Note:</b>\r\n3.99% will also be considered as 3% and not 4.\r\n","constraints":"<p><ul>\r\n<li>0&ltT&lt=10</li>\r\n<li>0&lt=N&lt10^4</li>\r\n</ul></p>","example":"<b>Input:</b>\r\n3\r\n3\r\n11*\r\n10\r\n1*11111111\r\n3\r\n*1*\r\n\r\n<b>Output:</b>\r\n33%\r\n10%\r\n66%\r\n","explanation":"<b>Test case 3:</b>\r\nThere are 2 shiny Pokemon out of 3.\r\nTherefore it becomes 66.66667%\r\nSince we are supposed to only print the integer value, the answer is 66%\r\n","contestCode":"SRM10","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM10%2FVkJsk8tG1.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM10%2FVkJsk8tG1.out?alt=media","createdAt":{"$date":"2019-08-04T15:03:42.449Z"},"updatedAt":{"$date":"2019-08-10T07:22:45.04Z"},"__v":0}
,{"_id":{"$oid":"5d46f62486031f00223f4ce8"},"tags":["vectors","strings"],"code":"SRM10C","points":250,"name":"Billy's PC","description":"This is Billy here. I manage the trainers battle group and PC Pokemon all over the Kanto region. Since you have managed to solve two of the major issues I need someone to help me with some work .\r\n\r\nThe back end code of the PC is not working anymore so i need your help to write a new one. When a trainers captures a new Pokemon we get input as \r\n<b>“captured Pokemon_name”</b>\r\nSo if the trainer has less than 6 Pokemon on his team add that Pokemon to his team, otherwise it will be transferred to PC. \r\n\r\nWhen a trainer deposits a Pokemon to PC we get input as \r\n<b>“deposit Pokemon_name” </b>\r\nIf he has only one Pokemon on his team and tries to deposit it, then the machine denies it automatically and you don’t need to code for that.      \r\n\r\nWhen the trainer tries to withdraw a Pokemon. He can only carry 6 Pokemon, if he withdraws a Pokemon it will be added to the last position in his team.\r\nThe machine doesn't allow the trainer to carry more than 6 Pokemon. \r\n\r\nShow the battle box to the trainer after all the operations.","explainInput":"The first line consists of a single integer <b>T</b>, denoting the number of test cases.\r\nThe first line of each test case consists of a single integer <b>N</b>, denoting the number of operations.\r\nThen N lines follow, consisting of strings which denotes the operations performed by the pc user.\r\n","explainOutput":"For each test case,\r\nThe output should consist of the names of the Pokemon on the trainers battle group, one on each line.\r\n","constraints":"0&ltT&lt=100\r\n0&ltN&lt=50","example":"INPUT-\r\n1\r\n13\r\ncaptured treeco\r\ncaptured larvitar\r\ncaptured charmander\r\ndeposit treeco\r\ncaptured beldum\r\ncaptured totodile\r\ncaptured metagross\r\ncaptured gligar\r\ndeposit metagross\r\nwithdraw treeco\r\ndeposit charmander\r\ncaptured mareep\r\ncaptured chimchar\r\nOutput-\r\n\r\nlarvitar\r\nbeldum\r\ntotodile\r\ngligar\r\ntreeco\r\nmareep","explanation":"He captured Treeco,Larvitar and Charmander and then Treeco\r\nso current team becomes\r\nlavritar\r\ncharmander\r\nthen Captures beldum,totodile,metagross and gligar.\r\nthen deposit metagross and withdraws treeco and deposits charmander.\r\nso current team is \r\nlarvitar\r\nbeldum\r\ntotodile\r\ngligar\r\ntreeco\r\nand captured mareep and chimchar \r\nso final team is\r\nlarvitar\r\nbeldum\r\ntotodile\r\ngligar\r\ntreeco\r\nmareep\r\n\r\n\r\n","contestCode":"SRM10","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM10%2FvL2XXXpG2.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM10%2FvL2XXXpG2.out?alt=media","createdAt":{"$date":"2019-08-04T15:13:40.768Z"},"updatedAt":{"$date":"2019-08-10T06:47:19.251Z"},"__v":0}
,{"_id":{"$oid":"5d49981887a3d00022372d92"},"tags":["arrays","math"],"code":"SRM10B","points":200,"name":"OH? Something is happening. ","description":"Barath and Mithil are playing Pokemon Go and are currently trying to hatch eggs. They want to find out a way to get rarer Pokemon.\r\nThe more distance the egg takes to hatch the rarer the Pokemon is.\r\nThere are 3 types of eggs in the game: 2Km, 5Km and 10Km eggs.\r\nYou will be given an integer <b>E</b>, denoting the number of eggs they have and the distance required to hatch each egg,<b> D[i].</b>\r\nYou will also be given the number of trips <b>N </b>they took and distance travelled in each trip <b>B[i]</b> by Barath and <b>M[i] </b>by Mithil.\r\n10Km egg has a rarity factor of 10.\r\n5Km egg has a rarity factor of 5. \r\n2km egg has a rarity factor of 2.\r\nThey will incubate the egg with the most rarity factor first and only one egg can be incubated at at time.\r\nAlso they will not incubate an egg with lesser rarity factor when an egg with higher factor exists\r\nYou are supposed to find out who can have the higher rarity factor after <b>N </b>trips, Barath or Mithil.\r\n\r\n","explainInput":"The first line of the input consists of a single integer <b>T</b> denoting the number of test cases\r\nThe first line of each test case consists of a single integer <b>E</b>\r\nThe next line consists of <b>E</b> space-separated integers <b>D[i]</b>\r\nThe next line consists of a single integer <b>N</b>, the number of trips Barath and Mithil went for\r\nThe next line will consist of the distances travelled by Barath in his <b>N </b>number of trips <b>B[i]</b>.\r\nThe next line will consist of the distances travelled by Mithil in his <b>N</b> number of trips <b>M[i]</b>.\r\n","explainOutput":"For each test case,\r\nThe first line should have the name of trainer with higher rarity factor or “Draw” if both of them have the same rarity factors\r\nThe second line should have 2 space-separated integers, the rarity factors of Barath and Mithil respectively.\r\n","constraints":"0&ltT&lt=40\r\n0&ltE&lt=10^4\r\nD[i]=2/5/10\r\n0&ltN&lt=10^4\r\n0&ltB[i],M[i]&lt1000.","example":"Input\r\n3\r\n5\r\n2 5 10 5 2 \r\n2 \r\n2 6\r\n4 8\r\n3\r\n2 5 10\r\n2\r\n8 7\r\n6 5\r\n4\r\n10 10 5 5\r\n3\r\n2 2 1\r\n1 1 3\r\nOutput\r\nMithil\r\n0 10\r\nBarath\r\n15 10\r\nDraw\r\n0 0","explanation":"<b>Test Case 1:</b>\r\nTotal distance travelled by barath -> 2 + 6 = 8\r\nSince they won’t hatch any eggs with smaller rarity factor in existence of higher ones, Barath won’t go for the eggs with rarity factors of 5\r\nHence his final rarity factor remains 0\r\n\r\nTotal distance travelled by Mithil -> 4 + 7 = 11\r\nMithil can go for the egg with rarity factor 10\r\nLater he remains with only 1 point ( 11 - 10 ), hence he stops\r\nHence his final rarity factor is 10\r\n","contestCode":"SRM10","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM10%2FBO5PEWYj0.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM10%2FBO5PEWYj0.out?alt=media","createdAt":{"$date":"2019-08-06T15:09:12.734Z"},"updatedAt":{"$date":"2019-08-10T07:16:39.624Z"},"__v":0}
,{"_id":{"$oid":"5d615f02ec3cc6002207e857"},"tags":["math"],"code":"SRM11A","points":100,"name":"Cirtangle","description":"Mithil loves eating in a circular plate on a rectangular table surface. Lately he’s been visiting many places with different plate and table sizes. Mithil is happy only if the table is large enough to occupy the plate <b>completely</b>. \r\nThe dimensions of the rectangular table surface are <b>N</b> x <b>M</b>. The radius of the circular plate is <b>R</b>.\r\nCan you tell if Mithil is happy or not?\r\n","explainInput":"<ul>\r\n<li>The first line of the input contains a single integer <b>T</b> denoting the number of test cases. The description of <b>T</b> test cases is as follow:\r\n</li>\r\n<li>The first and only line of each test case contains <b>3</b> space separated integers <b>N</b>, <b>M</b> and <b>R</b>.</li>\r\n</ul>","explainOutput":"For each test case, print a single line containing the string \"<b>YES</b>\" if the table is large enough to occupy the plate or else \"<b>NO</b>\" (without quotes).\r\n","constraints":"1 ≤ <b>T</b> ≤ 250\r\n1 ≤ <b>N</b>, <b>M</b>, <b>R</b> ≤ 1000\r\n","example":"<b>Input:</b>\r\n2\r\n8 4 1\r\n3 1 1\r\n\r\n<b>Output:</b>\r\nYES\r\nNO","explanation":"<b>Example case 1:</b>\r\nThe table is large enough.\r\n<img src=\"https://i.imgur.com/HbYLn9e.png\">\r\n<b>Example case 2:</b>\r\nNo matter what, the dish is too large for the table.\r\n<img src=\"https://imgur.com/Jq3rvKB.png\">\r\n\r\n","contestCode":"SRM11","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM11%2FG4t-g8Y8A.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM11%2FG4t-g8Y8A.out?alt=media","createdAt":{"$date":"2019-08-24T16:00:02.44Z"},"updatedAt":{"$date":"2019-08-25T07:15:54.628Z"},"__v":0}
,{"_id":{"$oid":"5d616091ec3cc6002207e858"},"tags":["math"],"code":"SRM11C","points":150,"name":"Complex relationship","description":"I was the 1, she said. But I was -ve about it. She rooted me out of her life. And now I … am just ‘i’. It’s all imaginary until I found a real friend, but now its complex.\r\nHelp ‘i‘ resolve the complex after repeatedly multiplying this friendship <b>N</b> times by itself.\r\n\r\nYou are given the complex number <b>X</b> + i<b>Y</b>. Multiply <b>i</b> to this number <b>N</b> times. \r\nOutput the resultant complex number.\r\n","explainInput":"<ul><li>The first line of the input contains a single integer <b>T</b> denoting the number of test cases. The description of <b>T</b> test cases is as follow:\r\n</li>\r\n<li>The first and only line of each test case contains <b>3</b> space separated integers <b>N</b>, <b>X</b> and <b>Y</b>.</li>","explainOutput":"For each test case, print a single line containing the real part and the imaginary part of the new complex separated by a space.","constraints":"1 ≤ <b>T</b> ≤ 250\r\n0 ≤ <b>N</b> ≤ 1000\r\n-100 ≤ <b>X, Y</b> ≤ 100\r\n","example":"<b>Input:</b>\r\n2\r\n2 2 -3\r\n0 4 0\r\n\r\n<b>Output:</b>\r\n-2 3\r\n4 0\r\n","explanation":"<b>Example case 1:</b>\r\nThe complex number is 2-3i.\r\nMultiplying i once : 2i+3\r\nMultiplying i again: -2+3i\r\n","contestCode":"SRM11","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM11%2FihltxCTOL.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM11%2FihltxCTOL.out?alt=media","createdAt":{"$date":"2019-08-24T16:06:41.281Z"},"updatedAt":{"$date":"2019-08-25T07:21:34.389Z"},"__v":0}
,{"_id":{"$oid":"5d61680dec3cc6002207e876"},"tags":["math"," strings"],"code":"SRM11B","points":100,"name":"Jagga plays TT","description":"Jagadish is playing Table Tennis for the first time at our Indoor Play Area and he is interested to play this game but doesn’t know the game rules/basics. So, you’re assigned to be the assistant of Jagadish to let him know his score and status. \r\n\r\nIf Opponent does <b>incorrect service / strikes ball twice / fail to return</b>, Jagadish will get <b>+1 / 2 / 3</b>  points, <b>respectively</b>. \r\nJagadish is new to the game, so he is prone to failed services. \r\nAfter every <b>three</b> failed services, he will get a <b>foul</b> and will <b>lose all his points</b>.\r\nEvery game lasts for <b>N</b> rounds from Jagadish and his opponent.\r\n\r\n<b>Note:</b> For Every Foul by Jagadish, his score is reset to 0 and his number of failed services is also reset to 0.","explainInput":"First Line of Input contain an integer <b>T</b> denoting the number of test cases.\r\nEach Test Case contains:\r\nFirst line would be <b>N</b> -> the length of string\r\nSecond line would be a string of letters where:\r\n<b>O</b> denotes Incorrect Service by opponent\r\n<b>B</b> denotes Ball striking twice by opponent\r\n<b>F</b> denotes Failed return by opponent\r\n<b>S</b> denotes Failed Service by Jagadish","explainOutput":"For each test case, output a <b>single line</b> with the <b>final score</b> of Jagadish","constraints":"1 &le; <b>TestCases</b> &le; 100\r\n1 &le; <b>N</b> &le; 50\r\n","example":"<b>Input:</b>\r\n2\r\n11\r\nOFSBSOFFBBS\r\n8\r\nSBSSFOBS\r\n<b>Output:</b>\r\n0\r\n6\r\n","explanation":"In the <b>first case</b>, Jagadish scores +17 from (2 O’s, 3 B’s, 3 F’s) but the count of S becomes 3 at the end of string , so his score is 0. \r\n\r\nIn the <b>second case</b>, Jagadish scores from (2 B’s, 1 O’s ,1 F’s) but after completion of 3 S’s, he scored FOBS(3+1+2) = 6 points\r\nScore is calculated as: (Number of O * 1) + (Number of B * 2) + (Number of F * 3) which will be equal to zero when Count of S turns to 3. When Count of S becomes 4, Count of S becomes 1 ( as it is reset to 0 after 3 failed services ) and Final Score of Jagadish is 6.\r\n","contestCode":"SRM11","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM11%2FnhvFEpRaY.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM11%2FnhvFEpRaY.out?alt=media","createdAt":{"$date":"2019-08-24T16:38:37.828Z"},"updatedAt":{"$date":"2019-08-25T07:44:22.866Z"},"__v":0}
,{"_id":{"$oid":"5d623acae007440022d873c0"},"tags":["math","adhoc"],"code":"SRM11D","points":200,"name":"Catch-a Local","description":"It’s College time and Surya is back into action. Surya needs to catch a local to reach college on time, so he wants to calculate if he could catch the train or not. \r\n\r\nThere are <b>N</b> cases where Surya describes the <b>M</b>, <b>S</b> and <b>T</b>.\r\nSurya takes <b>M</b> time to reach the station, his station number (destination) is <b>S</b> and Train takes <b>T</b> time to reach this station. Also, Train stops for <b>20</b> extra seconds at <b>each</b> station for passengers to get down / up the train. \r\n\r\nSurya is lazy , so help him in checking whether he could catch the train or not. \r\n","explainInput":"First Line of Input contain an integer <b>N</b> denoting the number of test cases.\r\nEach Test case consists of one line, which contains \r\n<b>M</b> (Time taken by Surya),\r\n<b>S</b> (Sth Station is the station to be reached),\r\n<b>T</b> (Time taken by train) \r\nin order.\r\nAll time mentioned is in the format mm:ss(minutes:seconds) or mm(minutes) if the seconds part is zero/insignificant.\r\n\r\n<b>Eg</b>: 12:00 can be taken as 12 since seconds part of “12:00” is zero/insignificant, while 02:04 cannot be represented / accepted as 2:4 or 02:4 or 2:04. \r\n","explainOutput":"For each test case, output a single line with the Result: “<b>+seconds</b>” or “<b>-seconds</b>”.\r\ni.e, ‘+’ for <b>catching train</b> and ‘-’ for <b>missing the train</b>, with the difference in time(seconds) taken by Surya to arrive as S and the train to depart from S .","constraints":"1 <= <b>TestCases</b> <= 10^4\r\n01 <= <b>mm</b> <= 120\r\n01 <= <b>ss</b> <=59 (Seconds)\r\n1 <= <b>S</b> <= 20","example":"<b>Input:</b>\r\n2\r\n12 3 21:44\r\n34 2 15:20\r\n<b>Output:</b>\r\n+644\r\n-1080\r\n","explanation":"In the <b>first case</b>, Surya takes 12 minutes to reach while Train takes {21:44+Delay} time , hence, Surya catches Train with 644 seconds remaining.\r\n\r\nIn the <b>second case</b>, Surya missed train by 1080 seconds since train took (15:20+Delay} time to reach at and depart from <b>S</b> and Surya took 34 minutes to reach station. ","contestCode":"SRM11","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM11%2FxbGuXpIFX.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM11%2FxbGuXpIFX.out?alt=media","createdAt":{"$date":"2019-08-25T07:37:46.627Z"},"updatedAt":{"$date":"2019-08-25T10:13:32.825Z"},"__v":0}
,{"_id":{"$oid":"5d7a599fb112e300220a44d0"},"tags":["cakewalk","arrays"],"code":"SRM12A","points":100,"name":"Stage 1: Yusuf’s dream","description":"<p><span style=\"font-weight: 400;\">Cobb, Arthur, Eames, Ariadne and Yusuf are \"extractors\": they perform corporate espionage using experimental military technology to infiltrate the subconscious of their targets and extract valuable information through a shared dream world. Their latest client, Japanese businessman Saito, has a seemingly impossible job for the team: implanting an idea in a person's subconscious, or &lsquo;inception&rsquo;. To break up the energy conglomerate of ailing competitor Maurice Fischer, Saito wants Cobb to convince Fischer's son and heir, Robert, to dissolve his father's company via an &lsquo;inception&rsquo;.</span></p>\r\n<p><span style=\"font-weight: 400;\">The job is set into motion when Maurice Fischer dies and his son accompanies his father's body from Sydney to Los Angeles. During the flight, Cobb sedates Fischer, and the team brings him into a three-level shared dream.</span></p>\r\n<p><span style=\"font-weight: 400;\">In the first level, Yusuf's dream of a rainy city, the team successfully abducts Fischer, but the team is attacked by Fischer's militarized subconscious projections, which have been trained to hunt and kill extractors.&nbsp;</span></p>\r\n<p><span style=\"font-weight: 400;\">The sedated team is travelling in a car, driven around by Yusuf. The car capable of handling a damage of at most </span><strong>X </strong><span style=\"font-weight: 400;\">points. A series of attacks is inflicted on the car by the aforementioned projections. Each successful attack on the car (denoted by a positive value </span><strong>Y</strong><span style=\"font-weight: 400;\">) inflicts a damage of amount </span><strong>Y</strong><span style=\"font-weight: 400;\">,</span> <span style=\"font-weight: 400;\">and each miss is denoted by a zero or a negative value </span><strong>Z</strong><span style=\"font-weight: 400;\">.&nbsp;</span></p>\r\n<p><span style=\"font-weight: 400;\">Can Cobb and his team survive the attack and make it to the second stage?</span></p>","explainInput":"<p> The first line of input contains an integer <strong>T</strong> denoting the number of test cases.\r\nEach test case consists of two lines; the first line contains the number of infliction <strong>N</strong>, and the damage-capacity <strong>X</strong> of the car; and the next line contains the series of attacks inflicted (series of integers <strong>Y</strong> and <strong>Z</strong>). </p>","explainOutput":"<p>For each test case, output a single line with the string &ldquo;successful&rdquo; or &ldquo;unsuccessful&rdquo; (without quotes).</p>","constraints":"<p>1 &le; T &le; 100\r\n1 &le; N &le; 100\r\n1 &le; X &le; 10<sup>9</sup>\r\n1 &le; Y &le; 10<sup>6</sup>\r\n-10<sup>6</sup> &le; Z &le; 0\r\n</p>","example":"<strong>Input:</strong>\r\n3\r\n10 1000\r\n1 2 3 4 -6 8 10 100 -12030 20\r\n6 100\r\n1001 -199 200 300 -2391 0\r\n5 500\r\n100 200 150 -2313 50\r\n\r\n<strong>Output:</strong>\r\nsuccessful\r\nunsuccessful\r\nsuccessful\r\n","explanation":"Case 1:\r\nThe total damage inflicted is less than the damage-capacity of the car.\r\n\r\nCase 2:\r\nThe inflicted damage exceeds the damage-capacity of the car.\r\n\r\nCase 3:\r\nThe total damage inflicted is equal to the damage-capacity of the car.\r\n","contestCode":"SRM12","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM12%2FO51WIfwq_.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM12%2FO51WIfwq_.out?alt=media","createdAt":{"$date":"2019-09-12T14:43:43.575Z"},"updatedAt":{"$date":"2019-09-12T15:00:35.929Z"},"__v":0}
,{"_id":{"$oid":"5d7a604bb112e300220a44d1"},"tags":["arrays","dp"],"code":"SRM12B","points":300,"name":"Stage 2: Arthur’s dream","description":"Yusuf remains on the first level driving a van through the streets, while the remaining team successfully enter stage 2; Arthur's dream, taking place in a corporate hotel.\r\n\r\nThe remainder of the team is sedated, while Arthur is bestowed with the responsibility of setting up the ‘kick’. A ‘kick’ is a sudden jolt that awakens the sleeper from the dream. The ‘kick’ in this stage is a set of bombs that need to detonate in synchronization. \r\n\r\nThere are <strong>N</strong> bomb-sites, each having a detonation-value, i.e., amount of damage done when a bomb is placed at that particular site. Arthur’s objective is to place the bombs in a permutation, such that the overall detonation-value is maximized. However, placing two bombs adjacent to each other shall result in an unsynchronized detonation, which should be avoided at all costs.\r\n\r\nShoot! The projections are firing at the team. Can you help Arthur in setting up the bombs and maximizing the detonation-value,  while he takes care of the projections?\r\n","explainInput":"The first line of input contains an integer <strong>T</strong> denoting the number of test cases. \r\nEach test case consists of two lines; the first line contains the number of bomb-sites <strong>N</strong>, and the next line contains a series of detonation-values (<strong>a<sub>i</sub></strong>) of the bomb-sites.","explainOutput":"For each test case, output a single line with the maximum possible detonation value.","constraints":"1 &le; T &le; 100\r\n1 &le; N &le; 10<sup>3</sup>\r\n0 &le; a<sub>i</sub> &le; 10<sup>3</sup>","example":"<strong>Input:</strong>\r\n2\r\n6\r\n1 5 10 100 10 5\r\n4\r\n12 9 7 33\r\n\r\n<strong>Output:</strong>\r\n110\r\n45\r\n","explanation":"Case 1:\r\nHere, by adding a[1] + a[3] + a[5] we get the maximum detonation-value as 110.\r\n\r\nCase 2:\r\nHere, by adding a[0] + a[3] we get the maximum detonation-value as 45.\r\n","contestCode":"SRM12","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM12%2FJRQ-hMvcs.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM12%2FJRQ-hMvcs.out?alt=media","createdAt":{"$date":"2019-09-12T15:12:11.975Z"},"updatedAt":{"$date":"2019-09-12T15:14:32.329Z"},"__v":0}
,{"_id":{"$oid":"5d7a635db112e300220a44d2"},"tags":["strings"," adhoc"],"code":"SRM12C","points":200,"name":"Stage 3: Eames’ dream","description":"Cobb, Eames, Ariadne, Saito and Fischer have reached the final stage of the espionage. All they gotta do is infiltrate the fortified hospital, and find Robert Fischer’s father. \r\n\r\nThe team’s fighting off the projections, providing a cover for Fischer, who’s en route to find his father inside the hospital. He finally finds the safe room where his father is waiting for him. Fischer cannot enter the safe room as it is guarded by a security question which reads as follows:\r\n\r\nGiven a string <strong>S</strong> of length <strong>N</strong>, comprising of only 0’s and 1’s, find:\r\n<ul> \r\n<li>the maximum number of 0’s that can be flipped to a 1, such that no two 1’s are adjacent in the string.</il>\r\n<li>the string <strong>S’</strong>, after flipping the bits as mentioned above. If there is a possibility of flipping either of the 0’s (while the maximum number of flips remain the same), flip the 0 that occurs first in the input string <strong>(refer case 4 for better understanding)</strong>.</li>\r\n</ul>\r\n\r\nTime is ticking away.  Help Fischer meet his father to complete espionage successfully. \r\n","explainInput":"The first line of input contains an integer <strong>T</strong> denoting the number of test cases. \r\nThe first line of each test case contains a single integer <strong>N</strong>.\r\nThe next line contains a single string <strong>S</strong> with length <strong>N</strong>. It is guaranteed that the given string <strong>S</strong> does not have adjacent 1’s. ","explainOutput":"For each test case, print two lines: the first line containing one integer - the maximum number of flips and second line containing the string <strong>S’</strong>.","constraints":"1 &le; T &le; 1000\r\n1 &le; N &le; 10<sup>3</sup> ","example":"<strong>Input:</strong>\r\n4\r\n6\r\n010001\r\n11\r\n00101010000\r\n3\r\n000\r\n6\r\n100001\r\n\r\n<strong>Output:</strong>\r\n1\r\n010101\r\n3\r\n10101010101\r\n2\r\n101\r\n1\r\n101001\r\n","explanation":"Case 1:\r\nHere, only the 0 present in the 4<sup>th</sup> position can be flipped. Hence, maximum number of flips that can be made is equal to 1. The given string after the flip becomes: 010101.\r\n\r\nCase 2:\r\nHere, the 0’s present in the 1<sup>st</sup>, 9<sup>th</sup> and 11<sup>th</sup> position can be flipped. Hence, maximum number of flips that can be made = 3. The given string after the flips becomes: 10101010101.    \r\n\r\nCase 3:\r\nHere, the 0’s present in the 1<sup>st</sup> and 3<sup>rd</sup> position can be flipped. Hence, maximum number of flips that can be made = 2. The given string after the flips becomes: 101.    \r\n\r\nCase 4:\r\nHere, the 0 present in either the 3<sup>rd</sup> or 4<sup>th</sup> position can be flipped. Hence, maximum number of flips that can be made = 1. The given string after the flips becomes: 101001 as the first possible 0 is flipped.   ","contestCode":"SRM12","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM12%2FitmKT6Lh3.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM12%2FitmKT6Lh3.out?alt=media","createdAt":{"$date":"2019-09-12T15:25:17.921Z"},"updatedAt":{"$date":"2019-09-12T15:25:17.921Z"},"__v":0}
,{"_id":{"$oid":"5e15ec2073aedb002281070e"},"tags":["math"],"code":"SRM13A","points":100,"name":"So you think you can Dance?","description":"Alice and Bob are keen dancers. They are currently practising to participate in an international dance contest!\r\n\r\nAlice has <b>N</b> energy pills which help her when she gets tired. She wants to share these pills with Bob in such a way that both Alice and Bob get equal amount of these pills.\r\n\r\nFind the <b>maximum</b> number of pills Bob can get.","explainInput":"The first line of the input consists of a single integer <b>T</b>, denoting the number of Queries (Test Cases) .\r\nEach query consists of a single line containing a single integer <b>N</b>.","explainOutput":"For each query, output the answer in a <b> single line </b>.","constraints":"1 <= <b> T </b> <= 100\r\n1 <= <b> N </b> <= 10^9","example":"<b>Input:</b>\r\n3\r\n15\r\n16\r\n17\r\n\r\n\r\n\r\n\r\n<b>Output:</b>\r\n7\r\n8\r\n8\r\n","explanation":"There are 3 Queries.\r\n\r\n<b>Query 1:</b> \r\n15 pills can be divided into 7, 7 & 1.\r\nAlice and Bob can have 7 pills each, which is the <b>maximum</b> amount satisfying the condition that both Alice and Bob get equal amount of pills.","contestCode":"SRM13","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM13%2Ftguo-87g.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM13%2Ftguo-87g.out?alt=media","createdAt":{"$date":"2020-01-08T14:50:08.647Z"},"updatedAt":{"$date":"2020-01-08T14:50:08.647Z"},"__v":0}
,{"_id":{"$oid":"5e15ed4773aedb002281070f"},"tags":["math"],"code":"SRM13B","points":200,"name":" So you think you can Math?","description":"You are given a set consisting of <b>N</b> amount of <b>even</b> numbers and <b>M</b> amount of <b>odd</b> numbers.\r\n\r\nIn one move, you have to take any two of these numbers, delete them from the set, and store back <b>either</b> their <b>product or</b> their <b>summation</b>.\r\n\r\nYou <b>have</b> to continue this procedure until there is only one remaining element in the set.\r\n\r\nYou are supposed to tell if it is possible to make some moves in such a way that the remaining element is <b>odd</b>.\r\n","explainInput":"The first line of the input consists of a single integer <b>T</b>, denoting the number of test cases.\r\nEach test case consists of a single line containing two space-separated integers, <b>N</b> and <b>M</b>.\r\n","explainOutput":"For each test case, output a single line containing <b>yes</b> (strictly in lowercase) if it is possible to obtain an <b>odd</b> value, otherwise output <b>no</b> (strictly in lowercase)  if it is not possible.\r\n\r\n<b>Note:</b> Make sure your output is in lowercase, otherwise the compiler won’t be able to match it with the correct answer.","constraints":"1 <= T <= 100\r\n0 <= <b>N</b>, <b>M</b> <= 10^9\r\n<b>N</b> + <b>M</b> >= 1","example":"<b>Input:</b>\r\n2\r\n1 2\r\n0 1\r\n\r\n\r\n\r\n<b>Output:</b>\r\nyes\r\nyes\r\n","explanation":"There are 2 Test Cases:\r\n\r\n<b>Test Case 1:</b>\r\nThere is 1 even number & 2 odd numbers.\r\nWe can multiply the 2 odd numbers to obtain an odd number and then add it with the even number to again obtain an odd number.\r\nHence it is possible.\r\n","contestCode":"SRM13","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM13%2F8Hm2dhoT.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM13%2F8Hm2dhoT.out?alt=media","createdAt":{"$date":"2020-01-08T14:55:03.669Z"},"updatedAt":{"$date":"2020-01-08T15:16:21.479Z"},"__v":0}
,{"_id":{"$oid":"5e15eea073aedb0022810710"},"tags":["math"],"code":"SRM13C","points":300,"name":"So you think you can Dare?","description":"You are playing Truth & Dare with Miu - The smart cat.\r\nIt’s your turn and you chose to Dare!\r\n\r\nYou have <b>N</b> sticks with you, each of the length from <b>1</b> to <b>N</b>.\r\nMiu destroyed one of these sticks, specifically of length <b>X</b>.\r\nHence, now you have <b>N-1</b> sticks left of all lengths from <b>1</b> to <b>N</b> except <b>X</b>.\r\n\r\nNow you are allowed to <b>join all</b>, <b>some</b> or <b>none</b> of these sticks together to form a longer stick.\r\nYou are <b>NOT</b> allowed to break any stick.\r\n\r\nMiu dares you to form a stick of length <b>exactly L</b> using these <b>N-1</b> sticks.\r\nIs it possible to complete this task?\r\n","explainInput":"The first line of the input consists of a single integer <b>T</b> denoting the number of test cases.\r\nThe only line of each test case consists of three space-separated integers <b>N X</b> and <b>L</b>.\r\n","explainOutput":"For each test case, on a single line, output <b>yes</b> if it is possible to form a stick of length <b>L</b>. Else output <b>no</b>.\r\n\r\n","constraints":"1 <= <b>T</b> <= 1000\r\n2 <= <b>N</b> <= 10^9\r\n1 <= <b>X</b> <= <b>N</b>\r\n1 <= <b>L</b> <= 10^9\r\n\r\n","example":"<b>Input:</b>\r\n2\r\n5 2 8\r\n6 5 53\r\n\r\n\r\n\r\n<b>Output:</b>\r\nyes\r\nno\r\n\r\n","explanation":"There are 2 Test Cases\r\n\r\n<b>Test Case 1:</b>\r\nYou have sticks of lengths 1 to 5 except 2.\r\nSo you have sticks of length [ 1, 3, 4, 5 ]\r\nYou can form a stick of length 8 using the sticks of length of 5 & 3.\r\nYou can also form this stick using the sticks of length 1, 3 & 4.\r\n( Note that you <b>cannot</b> form this stick using 2 sticks of length 4 because you have only 1 stick of length 4. )\r\n\r\n","contestCode":"SRM13","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM13%2Fs3cmLoMx.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM13%2Fs3cmLoMx.out?alt=media","createdAt":{"$date":"2020-01-08T15:00:48.03Z"},"updatedAt":{"$date":"2020-01-08T15:00:48.03Z"},"__v":0}
,{"_id":{"$oid":"5e15efea73aedb0022810711"},"tags":["math"],"code":"SRM13D","points":300,"name":"So you think you can Think?","description":"You have a list of numbers.\r\nCurrently the list consists of only one integer <b>N</b>.\r\n\r\nIn <b>one</b> move, you have to do the following operations on the list in order:\r\n<ul>\r\n<li>Create a new empty list <b>NewList</b></li>\r\n<li>Iterate through your current list, and for each element <b>X</b> present in this list:\r\n1. If <b>X</b> is <b>Odd</b>, append the number (<b>X * 2</b>) to the <b>NewList</b>\r\n2. Else if <b>X</b> is <b>Even</b>, append the numbers (<b>X * 2</b>) and (<b>X + 1</b>) to the <b>NewList</b>\r\n3. Delete the element <b>X</b> from the current list.\r\n\t</li>\r\n<li>Assign <b>NewList</b> as the current list.</li>\r\n</ul>\r\nYou are supposed to find the <b>amount</b> of <b>Odd</b> numbers present in your list after performing this move <b>M</b> times.\r\n\r\nSince this number can be very large for larger cases, <b>output the answer Modulo (%) 10^9 + 7</b> (1000000007).\r\n(Refer to the explanation of the example for clarification )\r\n\r\n<b>Note</b>: Remember the following property while computing the answer to avoid integer overflows:-\r\n( A + B ) % MOD = ( A % MOD ) + ( B % MOD ).\r\n","explainInput":"The first line of the input consists of a single integer <b>T</b>, denoting the number of test cases.\r\nEach test case consists of a single line containing two space-separated integers <b>N</b> and <b>M</b>.\r\n","explainOutput":"For each test case, output the answer in a <b>single line</b>.\r\n","constraints":"1 <= <b>T</b> <= 10^4\r\n1 <= <b>N</b> <= 10^9\r\n1 <= <b>M</b> <= 10^5\r\n","example":"<b>Input:</b>\r\n3\r\n4 2\r\n3 1\r\n77 49\r\n\r\n\r\n<b>Output:</b>\r\n1\r\n0\r\n807526948\r\n","explanation":"There are 3 test cases\r\n\r\n<b>Test Case 1:</b>\r\nInitial list -> [ 4 ]\r\nAfter Move 1 -> [ 8, 5 ]\r\nAfter Move 2 -> [ 16, 9, 10 ]\r\nHence, there is only 1 odd number present in the final list (9).\r\nFinally since the answer is 1, and we have to output it modulo 10^9 + 7:\r\nThe final answer is =  1 % (10^9 + 7) = 1\r\n\r\n<b>Test Case 3:</b>\r\nThere are 4807526976 odd numbers present in the final list after 49 moves.\r\nThe final answer is =  4807526976 % (10^9 + 7) = 807526948\r\n\r\nBe aware of integer overflows.\r\n","contestCode":"SRM13","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM13%2Fd2rUZOwY.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM13%2Fd2rUZOwY.out?alt=media","createdAt":{"$date":"2020-01-08T15:06:18.215Z"},"updatedAt":{"$date":"2020-01-08T15:09:37.836Z"},"__v":0}
,{"_id":{"$oid":"5e2d10a1533c8d0022c770f2"},"tags":["Math"],"code":"SRM14A","points":100,"name":"Shadow Clone Jutsu","description":"Spring season is coming soon and so are the festivals in the leaf village. Houses, roads, shops all are being painted. All such missions are ‘D’ ranked missions which have to be given to the genins. So, all the genins of the Leaf village are given such small tasks. Naruto is one of them. He became upset again as the hokage gave him another easy mission.\r\n\r\nHe is given two tasks:-\r\n1. Paint the training ground\r\n2. Plant 100 trees\r\n\r\nHe wants to complete them all as soon as possible. So, he creates shadow clones to divide his work. He starts with the toughest job first which is to paint the training ground.\r\n\r\nThe ground is a square ground. Naruto uses his chakra to create <b>M</b> shadow clones. The shadow clones are given equal squares from the square ground ie the ground is divided into equal sizes of smaller squares. Out of the <b>M</b> shadow clones, only <b>X</b> shadow clones (<b>1<=X<=M</b>) can be given this job since each shadow clone is given equal sizes of squares. \r\n\r\nYou have to help Naruto calculate the maximum number of shadow clones <b>X</b> that can be given the job to paint the ground.\r\n\r\n","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases. \r\nThe first line of each test case contains an integer <b>M</b> denoting the number of shadow clones generated\r\n","explainOutput":"For each test case, output a single line with the integer <b>X</b> which is the maximum number of shadow clones that can be allotted the job to paint the ground.\r\n","constraints":"1<=T<=10^5\r\n1<=M<=10^9\r\n","example":"<b>Input:</b>\r\n2\r\n2\r\n6\r\n\r\n<b>Output:</b>\r\n1\r\n4\r\n\r\n\r\n","explanation":"<b>Test Case 1:</b> <br>\r\nOut of the two shadow clones, only 1 can be given the job to paint the ground since the ground can’t be divided into 2 equal squares.\r\n","contestCode":"SRM14","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM14%2Fmtrkj5cW.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM14%2Fmtrkj5cW.out?alt=media","createdAt":{"$date":"2020-01-26T04:08:01.201Z"},"updatedAt":{"$date":"2020-01-26T05:56:27.426Z"},"__v":0}
,{"_id":{"$oid":"5e2d1287533c8d0022c770f3"},"tags":["Math"],"code":"SRM14B","points":200,"name":"A Mission in the Land of Greens","description":"Rock Lee was given a mission after a long time. He had to help the merchants in the land of Greens. He is given a straight line path <b>ax+by=c</b>, which leads to the land of Greens. Since it is the first time he is given a mission to be completed by himself, he got so excited that he chose a random path <b>rx+sy = t</b>.\r\n\r\nYou have to tell them if the path he has chosen will ever intersect with the actual path which leads to the Land of Greens. Can you help him?\r\n\r\n","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases. \r\nFirst line of each test case consists of 3 <b>integers</b> <b>a, b</b> and <b>c</b> where a and b both can’t be 0.\r\nSecond line of each test case consists of 3 <b>integers</b> <b>r, s</b> and <b>t</b> where r and s both can’t be 0.\r\n","explainOutput":"For each test case, print the answer to it as <b>\"YES\"</b> if the lines intersect each other ever or <b>\"NO\"</b> (both without quotes) otherwise.\r\n\r\n","constraints":"1<=<b>T</b><=10^5\r\n-10^6<=<b>a,b,c,r,s,t</b><=10^6\r\n","example":"<b>Input:</b>\r\n2\r\n-7 1 2\r\n3 8 7\r\n3 -1 3\r\n2 -1 6\r\n<br>\r\n<b>Output:</b>\r\nYES\r\nYES\r\n","explanation":"Both lines intersect at a point.\r\n","contestCode":"SRM14","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM14%2FwRqSO4vz.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM14%2FwRqSO4vz.out?alt=media","createdAt":{"$date":"2020-01-26T04:16:07.733Z"},"updatedAt":{"$date":"2020-01-26T12:32:15.616Z"},"__v":0}
,{"_id":{"$oid":"5e2d281c533c8d0022c770fd"},"tags":["Math"," Greedy"],"code":"SRM14C","points":200,"name":"Lady Tsunade Needs Help","description":"It becomes really tiring for lady Tsunade every time there is a mission to select genins,chunins and jonins for that mission. The team has to have proper skills in order to make the mission a successful one. So, she decides to give a number to every Shinobi of the Leaf village so that it would be easier for her to select a team when a mission arrives. \r\n\r\nThe number assigned to every Shinobi is the multiplication of the skills he has acquired. Lady Tsunade has to select the best possible team with the available Shinobis. Every mission is ranked <b>X</b> according to the difficulty of that mission. Lady Tsunade has to find the possible number of groups that can be formed with the available Shinobis. \r\n\r\nThe groups formed has to have <b>gcd % X = 0</b> (gcd divisible by X) in order to have a balanced group. Each group consists of <b>3</b> members.\r\n\r\nYour task is to tell the <b>maximum</b> number of groups of <b>gcd % X = 0</b> which can be formed.\r\n","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases. \r\nFirst line of each test case consists of two integers <b>N</b> and <b>X</b> \r\nwhere <b>N</b> denotes the size of array and <b>X</b> denotes the gcd required to form teams\r\nSecond line consists of a series of values <b>A[i]</b> which denotes the number given to the Shinobis\r\n\r\n","explainOutput":"For each test case, output a single line with the integer","constraints":"1<=<b>T</b><=10^3\r\n1<=<b>N</b><=10^5\r\n1<=<b>X</b><=10^9\r\n1<=<b>A[i]</b><=10^9\r\n","example":"<b>Input:</b>\r\n2\r\n7 3\r\n3 6 9 2 5 5 18 \r\n9 4\r\n2 4 6 5 17 9 1 12 7\r\n\r\n<b>Output:</b>\r\n1\r\n0\r\n","explanation":"<b>Test Case 1:</b> <br>\r\nOne of the possible teams can be {3, 9, 18}. <br>\r\nNo other teams can be formed. (You cannot use a Shinobi multiple times)\r\n","contestCode":"SRM14","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM14%2FxIWhnG5C.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM14%2FxIWhnG5C.out?alt=media","createdAt":{"$date":"2020-01-26T05:48:12.804Z"},"updatedAt":{"$date":"2020-01-26T06:06:42.22Z"},"__v":0}
,{"_id":{"$oid":"5e2d29af533c8d0022c770fe"},"tags":["Greedy, adhoc"],"code":"SRM14D","points":300,"name":"Kakashi vs Shikamaru","description":"Shikamaru is known for his amazing intellect.  <br> \r\nKakashi decided to find out the true extent of his abilities. \r\n\r\nKakashi gave him <b>N</b> cards. <br>\r\nEach of these cards had a number written on them in the order: <br>\r\n<b> A1 A2 A3 … AN </b>\r\n\r\nIn <b>one</b> move, Shikamaru is allowed to do any <b>one</b> of the following tasks: <br>\r\n<b>1)</b> Change the number on any <b>1</b> card to any other number <br>\r\n<b>2)</b> Place the last card at the start of the sequence. (More formally, A[i+1] = A[i] for 2 <= i <= N and A[1] = A[N])\r\n\r\nShikamaru is supposed to make moves on this sequence of cards in such a way that the final numbers on the cards are: <br>\r\n<b> 1 2 3 … N </b> <br>\r\nin the same order.\r\nThis should be done in the <b>minimum</b> number of moves possible.\r\n\r\nHelp Shikamaru to complete this task. \r\n","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases. <br>\r\nThe first line of each test case consists of a single integer <b>N</b>. <br>\r\nThe second line consists of <b>N</b> space-separated integers <b>A[i]</b>.\r\n\r\n","explainOutput":"For each test case, print the <b>minimum</b> number of moves required in a single line\r\n","constraints":"1 <= <b>T</b> <= 1000\r\n1 <= <b>N</b> <= 10^5\r\n1 <= <b>A[i]</b> <= 10^9\r\n","example":"<b>Input:</b>\r\n2\r\n4\r\n5 3 9 1\r\n6\r\n2 3 4 1 6 1\r\n\r\n<b>Output:</b>\r\n3\r\n2\r\n","explanation":"<b>Test case 1:</b>\r\nAfter Move 1: [1 5 3 9] <br>\r\nAfter Move 2: [1 2 3 9] <br>\r\nAfter Move 3: [1 2 3 4] <br>\r\n","contestCode":"SRM14","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM14%2FS-d-g2e3.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM14%2FS-d-g2e3.out?alt=media","createdAt":{"$date":"2020-01-26T05:54:55.207Z"},"updatedAt":{"$date":"2020-01-26T09:24:11.57Z"},"__v":0}
,{"_id":{"$oid":"5e6cb4e245fd530022f5ad68"},"tags":["math"," brute-force"],"code":"SRM15B","points":200,"name":"Anand hacks Aditya’s Laptop","description":"Aditya insulted Anand in front of everyone in the classroom. Anand decided to take revenge from Aditya, so he designed a plan to get Aditya's laptop for some time and hack into it and get all the important documents which he needs to blackmail him but the documents are password protected.\r\nPassword is <b>4</b> spaces long which consist of digits only, ranging from <b>1 to 5</b>, Anand is using brute force attack to unlock the documents.\r\n<b>D</b> is the no. of documents to be unlocked, <b>T</b> is the time after which Aditya will return, in that time you have to unlock one document and you have given the correct password, so you have to tell Anand whether it is possible to hack into Aditya's laptop before he comes.\r\n<b>1 sec</b> is required for each attempt. Your attack should start form <b>1111</b>. The hack is successful even if it takes exactly <b>T</b> seconds.\r\nAs Anand helps you in doing all class assignments, you should help him in hacking into Aditya’s laptop.","explainInput":"The first line of the input consists of a single integer <b>D</b> denoting the number of documents to be unlocked.\r\nFor each <b>D</b> there are two lines which give you time <b>T</b> in seconds, followed by the correct password.","explainOutput":"For each document, print a single line with “<b>YES</b>” if it is possible to hack the document and “<b>NO</b>” otherwise without the quotes.\r\n","constraints":"<ul>\r\n<li>1 <= <b>D</b> <= 10<sup>5</sup></li>\r\n<li>1 <= <b>T</b> <= 1000</li>\r\n</ul>","example":"Input:\r\n2\r\n40\r\n1234\r\n68\r\n1345\r\nOutput:\r\nYES\r\nNO\r\n","explanation":"For the first document brute force attack will start from \r\n1111  1 sec\r\n1112  2 sec\r\n1113  3 sec\r\n1114  4 sec\r\nAnd so on….\r\nFor 1234 it takes <b>39</b> sec which is less than <b>40</b> sec.\r\nTherefore it prints <b>YES</b>.\r\nFor the second document, it takes <b>70</b> sec which is greater than <b>68</b>.\r\nTherefore it prints <b>NO</b>.\r\n\r\n","contestCode":"SRM15","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM15%2FjbJpMveB.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM15%2FjbJpMveB.out?alt=media","createdAt":{"$date":"2020-03-14T10:41:38.463Z"},"updatedAt":{"$date":"2020-03-15T09:36:44.37Z"},"__v":0}
,{"_id":{"$oid":"5e6dfacd502c4b0022178adb"},"tags":["greedy"],"code":"SRM15A","points":200,"name":"Miu and Nodes","description":"Miu is impressed by the anonymity provided by the Darknet. It is achieved by passing the user request through various nodes(computers). The process is known as the onion routing.\r\n\r\nMiu decides to simulate onion routing by creating nodes to pass the user’s request.\r\nThese nodes work in such a way that a single node cannot pass two or more requests simultaneously and a node is engaged until an outgoing signal is sent for each incoming signal through that node or vice versa.\r\n\r\nEach user request has a priority level given by an integer <b>Pi</b> for incoming requests and outgoing requests. All <b>incoming</b> requests have a <b>higher</b> priority than <b>outgoing</b> requests, in case when their <b>priorities match</b> and hence must be processed first.\r\n\r\nMiu can not figure out the <b>minimum</b> number of nodes required so that no user request will get delayed. Help her.\r\nDisplay the optimal number of nodes required to make the system smooth.\r\n","explainInput":"The first line of the input contains a single integer <b>T</b>, denoting the number of test cases. The description of <b>T</b> test cases follows - \r\nThe first line contains the <b>N</b> number of incoming requests and <b>M</b> number of outgoing requests.\r\nThe second line contains <b>N</b> space separated integers <b>P1,P2,P3,...Pn</b>\r\nThe third line contains M space separated integers <b>P1,P2,P3,...Pm</b>","explainOutput":"For each test case, print a <b>single line</b> containing an integer - the <b>minimum</b> number of nodes required.","constraints":"<ul>\r\n<li>1 <= T <= 100</li>\r\n<li>1 <= M <= N <= 10<sup>5</sup></li>\r\n<li>1<= Pi <= 10<sup>9</sup></li>\r\n</ul>","example":"Example Input:\r\n2\r\n5 5\r\n3 1 5 4 6\r\n8 2 3 7 9\r\n3 2\r\n3 1 5\r\n2 4\r\n\r\nExample Output:\r\n3\r\n1\r\n","explanation":"Test Case 1:\r\n<img src=\"https://i.imgur.com/vSw4aTb.png\">\r\nTherefore, the minimum number of nodes required is 3.\r\n","contestCode":"SRM15","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM15%2FXfv8bz3-.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM15%2FXfv8bz3-.out?alt=media","createdAt":{"$date":"2020-03-15T09:52:13.093Z"},"updatedAt":{"$date":"2020-03-15T13:46:00.624Z"},"__v":0}
,{"_id":{"$oid":"5e6e0be659366b002223786e"},"tags":["adhoc"],"code":"SRM15C","points":300,"name":"Mercy and her kill list","description":"Mercy Rodgers is the deadliest hitwomen the darknet world has ever known. With over 430 brutal murders, neither has she ever missed her mark nor has she been caught even once. But one thing is very specific about Mercy, all her victims are people who had ill-treated women or children. Since she too had once been a victim of abuse, she carries every mission with full sense of revenge. \r\nOnce she is given <b>N</b> targets, she researches and analyses the severity of each <b>ith</b> target’s (<b>1</b> <= <b>i</b> <= <b>N</b>) misdeeds <b>M[i]</b>, strength and security around the target which she has to break <b>S[i]</b> and the probable number of witnesses at the scene of murder <b>W[i]</b>.\r\nMercy comes up with a way to calculate vengeance <b>V[i]</b> for her targets. It is\r\n<center><b>V[i] = M[i] + S[i] – W[i]</b></center>\r\nHigher the value of <b>V</b>, more difficult is the execution of the target and lower the <b>V</b>, easier is the execution.\r\nShe has decided that she would start by killing the <b>easiest</b> target followed by the <b>toughest</b> target and then followed by the <b>2nd easiest</b> target and so on.However, the following characteristics of Mercy must be taken into consideration:\r\n<ol>\r\n<li>Since Mercy still has some mercy, she spares targets who have her vengeance level V[i] as multiples of 5. </li>\r\n<li>She gains additional confidence when she kills targets who had V[i] as multiples of 3 and not 5, so she chooses a difficult target next even if it alters the sequence.</li>\r\n<li>If V[i] is a multiple of both 3 and 5, she spares the target.</li>\r\n<li>In case multiple targets have equal level of her vengeance, the one with earlier position is executed.</li>\r\n</ol>\r\nSince Mercy is short of time and high on urge for revenge, you being her personal assistant help her write the order in which she has to assassinate her targets.\r\n\r\n","explainInput":"The first line of input is <b>T</b> which denotes the number of test cases.\r\nThe first line of each test case is <b>N</b> which denotes the total numbers of targets.\r\nThe 2nd, 3rd and 4th line of each test case is a series of space separated numbers which is <b>M[i]</b>, <b>S[i]</b> and <b>W[i]</b> respectively of the targets.\r\n","explainOutput":"Each test case should output a series of integers on new line each denoting the target’s position on the kill list.","constraints":"1<= <b>T</b> <= 100\r\n1<= <b>N</b> <= 10<sup>5</sup>\r\n1<= <b>M[i]</b> <= 10<sup>9</sup>\r\n1<= <b>S[i]</b> <= 10<sup>9</sup>\r\n1<= <b>W[i]</b> <= 2*10<sup>9</sup>\r\n<b>V[i]</b> >= 1\r\n","example":"Input\r\n3\r\n5\r\n5 3 3 6 7 \r\n23 22 21 19 15\r\n2 5 8 4 3\r\n4\r\n3 4 8 10\r\n3 4 8 7\r\n2 2 2 2\r\n4\r\n3 4 8 10\r\n3 4 8 10\r\n2 2 2 2\r\nOutput\r\n3\r\n1\r\n5\r\n4\r\n1\r\n2\r\n3\r\n1\r\n4\r\n3\r\n2\r\n","explanation":"<b>Test Case 1:</b>\r\n<img src=\"https://i.imgur.com/UuBahgh.png\">\r\nThe easiest target at 3rd position on the list, the toughest at 1st, 2nd easiest at 5th , 2nd toughest chapter at 4th, and the 2nd target is spared.","contestCode":"SRM15","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM15%2FpOdidPG4.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM15%2FpOdidPG4.out?alt=media","createdAt":{"$date":"2020-03-15T11:05:10.276Z"},"updatedAt":{"$date":"2020-03-15T13:24:18.343Z"},"__v":0}
,{"_id":{"$oid":"5e8065b799770c00221d371a"},"tags":["string"],"code":"SRM16A","points":100,"name":"Go Corona, Corona Go","description":"Since the lockdown, Mithil has been coding just to end his boredom. Mithil who is also a pro gamer, thinks to play a Game and put away coding for some time. So today, the game he’s playing is about Spoidy. Spoidy is initially at a location <b>c=0</b>.\r\nMithil can press D and U:\r\n '<b>D</b>' moves character down, setting his position to <b>c − 1</b>\r\n '<b>U</b>' moves character up, setting his position to <b>c + 1</b>\r\n\r\nBut Mithil's controller is a bit old, it crashes at some instances. Sometimes few of the button presses are <b>ignored</b> and there is <b>no change</b> in Spoidy’s position. \r\nFor example, if Mithil sends instructions \"<b>UUD</b>\", it might be interpreted as any of the following:\r\n\r\n<b>UUD, UU, U, D, UD</b>\r\n\r\nMithil is unaware of which instructions will be sent successfully beforehand. Thus, he wants to know how many <b>different</b> locations may Spoidy end up at.\r\n\r\n","explainInput":"The first line of input contains an integer <b>T</b> denoting the number of test cases. The first and only line of each test case contains a string <b>S</b> of <b>N</b> commands, each either '<b>D</b>' or '<b>U</b>'.","explainOutput":"For each test case, print a single line consisting of <b>one integer</b> denoting the number of different locations Spoidy may end up at.","constraints":"1<= <b>T</b> <=100\r\n1<= <b>N</b> <= 10<sup>5</sup>\r\n","example":"Input:\r\n2\r\nUUD\r\nDUDU\r\nOutput:\r\n4\r\n5\r\n","explanation":"Test Case 1:\r\n<b>UUD</b> = 0+1+1-1 = 1\r\n<b>UU</b> = 0+1+1 = 2\r\n<b>U</b> = 0+1 = 1\r\n<b>D</b> = 0-1 = -1\r\n<b>UD</b> = 0+1-1 = 0\r\nSpoidy may end up anywhere between <b>-1,0,1,2</b>. Hence <b>4</b> unique locations.\r\n","contestCode":"SRM16","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM16%2FwUi0wldd-.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM16%2FwUi0wldd-.out?alt=media","createdAt":{"$date":"2020-03-29T09:09:11.144Z"},"updatedAt":{"$date":"2020-03-29T13:47:25.978Z"},"__v":0}
,{"_id":{"$oid":"5e8088ab99770c00221d371d"},"tags":["math,number theory"],"code":"SRM16B","points":250,"name":"Devin's Prime Time Hack","description":"Devin loves to work with graphics in his free time, and due to recent viral outbreaks, he wants to try working on a new graphic software which is out in the market. However his parents won’t allow him to buy the very expensive software and the serial key cannot be easily cracked. \r\nThe serial key is made up of <b>4 parts</b>. Each part has a <b>hexadecimal </b>code. The code is valid, if the <b>decimal</b> conversion of each individual part of the code (<b>N</b>) has a <b>prime count</b> of <b>factors</b>. For example, the number <b>\"13\"</b> has <b>2</b> factors “<b>1</b> and <b>13</b>”.<b> 2</b> is a <b>prime</b> number, hence <b>13</b> is valid.","explainInput":"The first line of input contains an integer T denoting the number of test cases.\r\nEach test case consists of 1 line of 4 “-” separated hexadecimal numbers ","explainOutput":"For each test case, output a single word “<b>YES</b>” or “<b>NO</b>” on a single line.","constraints":"1 <= <b>T</b> <= 100\r\n0 <= <b>N (in decimal)</b> <= 10<sup>9</sup>","example":"<b>Input:</b>\r\n2\r\nd-b3-bf-11b\r\naaa-caf-5b3-581\r\n\r\n<b>Output</b>:\r\nYES\r\nNO","explanation":"<b>Test Case 1:</b>\r\nThe first part converts to <b>13</b> in decimal which has <b>2 factors</b> (1 and 13). The second part converts to <b>179</b> which has <b>2 factors</b> (1 and 179). The third part converts to <b>191</b> in decimal which has <b>2 factors</b> (1 and 191). The fourth part converts to <b>283</b> in decimal which has <b>2 factors</b> (1 and 283). Hence the code is <b>valid</b>.\r\n\r\n<b>Test Case 2:</b>\r\nThe first part converts to <b>2730</b> in decimal which has <b>32 factors</b> but 32 is not prime. Hence the code is <b>invalid.</b>","contestCode":"SRM16","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM16%2FdiwlZmY31.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM16%2FdiwlZmY31.out?alt=media","createdAt":{"$date":"2020-03-29T11:38:19.621Z"},"updatedAt":{"$date":"2020-03-29T12:42:42.748Z"},"__v":0}
,{"_id":{"$oid":"5e80968d99770c00221d371e"},"tags":["math"],"code":"SRM16C","points":300,"name":"Secret Info","description":"Cibin, is the head of an intelligence agency. Since there is a lot of fake information, he wants to share some highly confidential information <b>S</b> to all the defense officials regarding this pandemic.\r\nHere the message to be sent is in a single word consisting of only lowercase English letters. For the confidentiality of the information he decides to encrypt the message. He makes a string <b>M</b> of length <b>N</b>, such that after deleting a substring of <b>non-zero</b> length from <b>M</b>, the remaining string is <b>S</b>. He needs your help to find out the number of all such possible ways he can form the string <b>M</b>.\r\n<b>Note:</b> The string <b>M</b> can be a combination of <b>lowercase</b> English letters.","explainInput":"First line contains the number of test cases <b>T</b>. \r\nFor each test case there is a single line which contains a space separated integer, <b>N</b> and a string <b>S</b>.\r\n","explainOutput":"For each test case, output the number of possible strings modulo <b>10^9+7</b>.","constraints":"1≤ <b>T</b> ≤ 1000\r\n1≤ <b>N</b> ≤10^18\r\n1≤ <b>|S|</b> ≤100\r\n<b>S</b> contains only lowercase English letters.","example":"<b>Input:</b>\r\n3\r\n2 a\r\n3 a\r\n3 ab\r\n<b>Output:</b>\r\n51\r\n1326\r\n76\r\n","explanation":"Following are some examples of 2 lettered words:\r\naa, ab, az, zz, bd, etc.\r\nWe can form <b>26*26 = 676</b> such words but only <b>51</b> out of them contain at least one ‘a’ so that we can form the string <b>S</b>. \r\nEg: We can get <b>‘a’</b> from <b>‘ab’</b> after removing the substring <b>‘b’</b>.\r\n       But we can’t get <b>‘a’</b> from <b>‘cd’</b> or <b>‘tf’</b>.\r\n","contestCode":"SRM16","inputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdin%2FSRM16%2FeKWMBpauU.in?alt=media","outputFile":"https://firebasestorage.googleapis.com/v0/b/siesgstarena-1819.appspot.com/o/stdout%2FSRM16%2FeKWMBpauU.out?alt=media","createdAt":{"$date":"2020-03-29T12:37:33.055Z"},"updatedAt":{"$date":"2020-03-29T13:50:09.46Z"},"__v":0}
]